[Survived] StringLiteral
app/employees/employee-list/employee-list.ts:19:43
   private readonly employeeService = inject(EmployeeService);
   private readonly router = inject(Router);
 
-  protected readonly searchQuery = signal('');
+  protected readonly searchQuery = signal("Stryker was here!");
 
   protected readonly employees = toSignal(

[Survived] LogicalOperator
app/employees/employee-list/employee-list.ts:26:37
       debounceTime(300),
       distinctUntilChanged(),
       switchMap(q =>
-        this.employeeService.getAll(q || undefined).pipe(catchError(() => of([])))
+        this.employeeService.getAll(q && undefined).pipe(catchError(() => of([])))
       )
     ),

[NoCoverage] BlockStatement
app/employees/employee-list/employee-list.ts:32:42
     { initialValue: [] as EmployeeProfileResponse[] }
   );
 
-  protected onSearch(event: Event): void {
-    this.searchQuery.set((event.target as HTMLInputElement).value);
-  }
+  protected onSearch(event: Event): void {}
 
   protected navigate(id: number): void {

[Killed] BlockStatement
app/employees/employee-list/employee-list.ts:36:40
     this.searchQuery.set((event.target as HTMLInputElement).value);
   }
 
-  protected navigate(id: number): void {
-    void this.router.navigate(['/employees', id]);
-  }
+  protected navigate(id: number): void {}
 }
 
killedBy: EmployeeListComponent navigates to employee profile on row click
statusReason: expected "navigate" to be called with arguments: [ [ '/employees', 1 ] ]

Number of calls: 0

[Killed] StringLiteral
app/employees/employee-list/employee-list.ts:37:32
   }
 
   protected navigate(id: number): void {
-    void this.router.navigate(['/employees', id]);
+    void this.router.navigate(["", id]);
   }
 }
killedBy: EmployeeListComponent navigates to employee profile on row click
statusReason: expected "navigate" to be called with arguments: [ [ '/employees', 1 ] ]

Received:

  1st navigate call:

  [
    [

[Killed] ArrayDeclaration
app/employees/employee-list/employee-list.ts:37:31
   }
 
   protected navigate(id: number): void {
-    void this.router.navigate(['/employees', id]);
+    void this.router.navigate([]);
   }
 }
killedBy: EmployeeListComponent navigates to employee profile on row click
statusReason: expected "navigate" to be called with arguments: [ [ '/employees', 1 ] ]

Received:

  1st navigate call:

  [
-   [
