[Killed] BlockStatement
src/app/auth/auth.guard.ts:11:38
   const authService = inject(AuthService);
   const router = inject(Router);
 
-  if (authService.isAuthenticated()) {
-    return true;
-  }
+  if (authService.isAuthenticated()) {}
 
   return new RedirectCommand(
killedBy: authGuard allows activation when authenticated
statusReason: expected RedirectCommand{ …(2) } to be true // Object.is equality

[Killed] ConditionalExpression
src/app/auth/auth.guard.ts:11:7
   const authService = inject(AuthService);
   const router = inject(Router);
 
-  if (authService.isAuthenticated()) {
+  if (false) {
     return true;
   }
killedBy: authGuard allows activation when authenticated
statusReason: expected RedirectCommand{ …(2) } to be true // Object.is equality

[Killed] BooleanLiteral
src/app/auth/auth.guard.ts:12:12
   const router = inject(Router);
 
   if (authService.isAuthenticated()) {
-    return true;
+    return false;
   }
 
killedBy: authGuard allows activation when authenticated
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/app/auth/auth.guard.ts:16:38
   }
 
   return new RedirectCommand(
-    router.createUrlTree(['/login'], { queryParams: { redirect: state.url } })
+    router.createUrlTree(['/login'], {})
   );
 };
killedBy: authGuard redirects to /login with the redirect query param when unauthenticated
statusReason: expected undefined to be '/home' // Object.is equality
