[Killed] BooleanLiteral
src/app/auth/auth.interceptor.ts:18:19
 
   const isLoginRequest = req.url.includes('/auth/login');
 
-  const authReq = !isLoginRequest && authService.getToken()
+  const authReq = isLoginRequest && authService.getToken()
     ? req.clone({ setHeaders: { Authorization: `Bearer ${authService.getToken()}` } })
     : req;
killedBy: authInterceptor adds Bearer token when authenticated
statusReason: expected null to be 'Bearer jwt-token' // Object.is equality

[Killed] ConditionalExpression
src/app/auth/auth.interceptor.ts:18:19
 
   const isLoginRequest = req.url.includes('/auth/login');
 
-  const authReq = !isLoginRequest && authService.getToken()
+  const authReq = true
     ? req.clone({ setHeaders: { Authorization: `Bearer ${authService.getToken()}` } })
     : req;
killedBy: authInterceptor does not add Authorization when there is no token
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/app/auth/auth.interceptor.ts:19:17
   const isLoginRequest = req.url.includes('/auth/login');
 
   const authReq = !isLoginRequest && authService.getToken()
-    ? req.clone({ setHeaders: { Authorization: `Bearer ${authService.getToken()}` } })
+    ? req.clone({})
     : req;
 
killedBy: authInterceptor adds Bearer token when authenticated
statusReason: expected null to be 'Bearer jwt-token' // Object.is equality

[Killed] BlockStatement
src/app/auth/auth.interceptor.ts:24:33
 
   return next(authReq).pipe(
     catchError(error => {
-      if (error.status === 401) {
-        authService.logout();
-        void router.navigate(['/login']);
-      }
+      if (error.status === 401) {}
       return throwError(() => error);
     })
killedBy: authInterceptor logs out and redirects to /login on a 401
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/app/auth/auth.interceptor.ts:24:11
 
   return next(authReq).pipe(
     catchError(error => {
-      if (error.status === 401) {
+      if (false) {
         authService.logout();
         void router.navigate(['/login']);
killedBy: authInterceptor logs out and redirects to /login on a 401
statusReason: expected true to be false // Object.is equality

[Survived] ArrowFunction
src/app/auth/auth.interceptor.ts:28:25
         authService.logout();
         void router.navigate(['/login']);
       }
-      return throwError(() => error);
+      return throwError(() => undefined);
     })
   );
