[Survived] BooleanLiteral
app/tasks/create-task/create-task.ts:31:48
   private readonly destroyRef = inject(DestroyRef);
 
   protected readonly employees = signal<EmployeeProfileResponse[]>([]);
-  protected readonly loadingEmployees = signal(true);
+  protected readonly loadingEmployees = signal(false);
   protected readonly submitting = signal(false);
   protected readonly errorMessage = signal<string | null>(null);

[Survived] BooleanLiteral
app/tasks/create-task/create-task.ts:32:42
 
   protected readonly employees = signal<EmployeeProfileResponse[]>([]);
   protected readonly loadingEmployees = signal(true);
-  protected readonly submitting = signal(false);
+  protected readonly submitting = signal(true);
   protected readonly errorMessage = signal<string | null>(null);
 

[Killed] ObjectLiteral
app/tasks/create-task/create-task.ts:36:55
   protected readonly errorMessage = signal<string | null>(null);
 
   protected readonly form = new FormGroup<CreateTaskForm>({
-    relatesToId: new FormControl<number | null>(null, { validators: [Validators.required] }),
+    relatesToId: new FormControl<number | null>(null, {}),
     title: new FormControl('', { nonNullable: true, validators: [Validators.required] }),
     description: new FormControl('', { nonNullable: true }),
killedBy: CreateTaskComponent is invalid when relatesToId is null
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
app/tasks/create-task/create-task.ts:39:30
     relatesToId: new FormControl<number | null>(null, { validators: [Validators.required] }),
     title: new FormControl('', { nonNullable: true, validators: [Validators.required] }),
     description: new FormControl('', { nonNullable: true }),
-    dueDate: new FormControl('', { nonNullable: true }),
+    dueDate: new FormControl("Stryker was here!", { nonNullable: true }),
     assigneeId: new FormControl<number | null>(null)
   });

[Killed] BlockStatement
app/tasks/create-task/create-task.ts:43:17
     assigneeId: new FormControl<number | null>(null)
   });
 
-  constructor() {
-    this.employeeService.getAll()
-      .pipe(takeUntilDestroyed(this.destroyRef))
-      .subscribe({
-        next: list => {
-          this.employees.set(list);
-          this.loadingEmployees.set(false);
-        },
-        error: () => {
-          this.loadingEmployees.set(false);
-          this.errorMessage.set('Failed to load employees.');
-        }
-      });
-  }
+  constructor() {}
 
   protected onSubmit(): void {
killedBy: CreateTaskComponent populates the employees signal after getAll() resolves
statusReason: expected [] to deeply equal [ { id: 1, …(7) }, { id: 2, …(7) } ]

[Killed] ObjectLiteral
app/tasks/create-task/create-task.ts:46:18
   constructor() {
     this.employeeService.getAll()
       .pipe(takeUntilDestroyed(this.destroyRef))
-      .subscribe({
-        next: list => {
-          this.employees.set(list);
-          this.loadingEmployees.set(false);
-        },
-        error: () => {
-          this.loadingEmployees.set(false);
-          this.errorMessage.set('Failed to load employees.');
-        }
-      });
+      .subscribe({});
   }
 
killedBy: CreateTaskComponent populates the employees signal after getAll() resolves
statusReason: expected [] to deeply equal [ { id: 1, …(7) }, { id: 2, …(7) } ]

[Killed] BlockStatement
app/tasks/create-task/create-task.ts:47:23
     this.employeeService.getAll()
       .pipe(takeUntilDestroyed(this.destroyRef))
       .subscribe({
-        next: list => {
-          this.employees.set(list);
-          this.loadingEmployees.set(false);
-        },
+        next: list => {},
         error: () => {
           this.loadingEmployees.set(false);
killedBy: CreateTaskComponent populates the employees signal after getAll() resolves
statusReason: expected [] to deeply equal [ { id: 1, …(7) }, { id: 2, …(7) } ]

[Survived] BooleanLiteral
app/tasks/create-task/create-task.ts:49:37
       .subscribe({
         next: list => {
           this.employees.set(list);
-          this.loadingEmployees.set(false);
+          this.loadingEmployees.set(true);
         },
         error: () => {

[NoCoverage] BlockStatement
app/tasks/create-task/create-task.ts:51:22
           this.employees.set(list);
           this.loadingEmployees.set(false);
         },
-        error: () => {
-          this.loadingEmployees.set(false);
-          this.errorMessage.set('Failed to load employees.');
-        }
+        error: () => {}
       });
   }

[NoCoverage] BooleanLiteral
app/tasks/create-task/create-task.ts:52:37
           this.loadingEmployees.set(false);
         },
         error: () => {
-          this.loadingEmployees.set(false);
+          this.loadingEmployees.set(true);
           this.errorMessage.set('Failed to load employees.');
         }

[Killed] BlockStatement
app/tasks/create-task/create-task.ts:59:28
   }
 
   protected onSubmit(): void {
-    if (this.form.invalid) {
-      this.form.markAllAsTouched();
-      return;
-    }
+    if (this.form.invalid) {}
 
     const raw = this.form.getRawValue();
killedBy: CreateTaskComponent shows validation error when title is empty and form is submitted
statusReason: expected '← My TasksNew TaskRelates to (employe…' to contain 'Title is required'

[Killed] ConditionalExpression
app/tasks/create-task/create-task.ts:59:9
   }
 
   protected onSubmit(): void {
-    if (this.form.invalid) {
+    if (false) {
       this.form.markAllAsTouched();
       return;
killedBy: CreateTaskComponent shows validation error when title is empty and form is submitted
statusReason: expected '← My TasksNew TaskRelates to (employe…' to contain 'Title is required'

[Killed] BooleanLiteral
app/tasks/create-task/create-task.ts:67:25
     const raw = this.form.getRawValue();
     if (raw.relatesToId === null) return;
 
-    this.submitting.set(true);
+    this.submitting.set(false);
     this.errorMessage.set(null);
 
killedBy: CreateTaskComponent sets submitting to true while the request is in flight then false on success
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
app/tasks/create-task/create-task.ts:73:20
     this.taskService.createStandalone({
       relatesToId: raw.relatesToId,
       title: raw.title,
-      description: raw.description || undefined,
+      description: raw.description && undefined,
       dueDate: raw.dueDate || undefined,
       assigneeId: raw.assigneeId ?? undefined
killedBy: CreateTaskComponent passes non-empty description through to the service
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] LogicalOperator
app/tasks/create-task/create-task.ts:74:16
       relatesToId: raw.relatesToId,
       title: raw.title,
       description: raw.description || undefined,
-      dueDate: raw.dueDate || undefined,
+      dueDate: raw.dueDate && undefined,
       assigneeId: raw.assigneeId ?? undefined
     }).pipe(takeUntilDestroyed(this.destroyRef))
killedBy: CreateTaskComponent passes non-empty dueDate through to the service
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
app/tasks/create-task/create-task.ts:78:21
       assigneeId: raw.assigneeId ?? undefined
     }).pipe(takeUntilDestroyed(this.destroyRef))
       .subscribe({
-        next: () => {
-          this.submitting.set(false);
-          void this.router.navigate(['/tasks/mine']);
-        },
+        next: () => {},
         error: () => {
           this.submitting.set(false);
killedBy: CreateTaskComponent navigates to /tasks/mine after successful submit
statusReason: expected "navigate" to be called with arguments: [ [ '/tasks/mine' ] ]

Number of calls: 0

[Killed] BooleanLiteral
app/tasks/create-task/create-task.ts:79:31
     }).pipe(takeUntilDestroyed(this.destroyRef))
       .subscribe({
         next: () => {
-          this.submitting.set(false);
+          this.submitting.set(true);
           void this.router.navigate(['/tasks/mine']);
         },
killedBy: CreateTaskComponent sets submitting to true while the request is in flight then false on success
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
app/tasks/create-task/create-task.ts:80:38
       .subscribe({
         next: () => {
           this.submitting.set(false);
-          void this.router.navigate(['/tasks/mine']);
+          void this.router.navigate([""]);
         },
         error: () => {
killedBy: CreateTaskComponent navigates to /tasks/mine after successful submit
statusReason: expected "navigate" to be called with arguments: [ [ '/tasks/mine' ] ]

Received:

  1st navigate call:

  [
    [

[Killed] ArrayDeclaration
app/tasks/create-task/create-task.ts:80:37
       .subscribe({
         next: () => {
           this.submitting.set(false);
-          void this.router.navigate(['/tasks/mine']);
+          void this.router.navigate([]);
         },
         error: () => {
killedBy: CreateTaskComponent navigates to /tasks/mine after successful submit
statusReason: expected "navigate" to be called with arguments: [ [ '/tasks/mine' ] ]

Received:

  1st navigate call:

  [
-   [

[Killed] BlockStatement
app/tasks/create-task/create-task.ts:82:22
           this.submitting.set(false);
           void this.router.navigate(['/tasks/mine']);
         },
-        error: () => {
-          this.submitting.set(false);
-          this.errorMessage.set('Failed to create task. Please try again.');
-        }
+        error: () => {}
       });
   }
killedBy: CreateTaskComponent resets submitting to false on service error
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
app/tasks/create-task/create-task.ts:83:31
           void this.router.navigate(['/tasks/mine']);
         },
         error: () => {
-          this.submitting.set(false);
+          this.submitting.set(true);
           this.errorMessage.set('Failed to create task. Please try again.');
         }
killedBy: CreateTaskComponent resets submitting to false on service error
statusReason: expected true to be false // Object.is equality

[NoCoverage] BlockStatement
app/tasks/create-task/create-task.ts:89:28
       });
   }
 
-  protected cancel(): void {
-    void this.router.navigate(['/tasks/mine']);
-  }
+  protected cancel(): void {}
 }
 
