[Survived] BooleanLiteral
app/auth/login/login.ts:22:42
   private readonly fb = inject(FormBuilder);
   private readonly destroyRef = inject(DestroyRef);
 
-  protected readonly submitting = signal(false);
+  protected readonly submitting = signal(true);
   protected readonly errorMessage = signal<string | null>(null);
 

[Survived] StringLiteral
app/auth/login/login.ts:26:13
   protected readonly errorMessage = signal<string | null>(null);
 
   protected readonly form = this.fb.nonNullable.group({
-    email: ['', [Validators.required, Validators.email]],
+    email: ["Stryker was here!", [Validators.required, Validators.email]],
     password: ['', [Validators.required, Validators.minLength(6)]]
   });

[Survived] StringLiteral
app/auth/login/login.ts:27:16
 
   protected readonly form = this.fb.nonNullable.group({
     email: ['', [Validators.required, Validators.email]],
-    password: ['', [Validators.required, Validators.minLength(6)]]
+    password: ["Stryker was here!", [Validators.required, Validators.minLength(6)]]
   });
 

[Killed] BlockStatement
app/auth/login/login.ts:30:30
     password: ['', [Validators.required, Validators.minLength(6)]]
   });
 
-  protected onSubmit(): void {
-    if (this.form.invalid) {
-      this.form.markAllAsTouched();
-      return;
-    }
-
-    this.submitting.set(true);
-    this.errorMessage.set(null);
-
-    this.authService.login(this.form.getRawValue())
-      .pipe(takeUntilDestroyed(this.destroyRef))
-      .subscribe({
-        next: () => {
-          const redirect = this.route.snapshot.queryParamMap.get('redirect') ?? '/home';
-          void this.router.navigateByUrl(redirect);
-        },
-        error: () => {
-          this.errorMessage.set('Invalid email or password.');
-          this.submitting.set(false);
-        }
-      });
-  }
+  protected onSubmit(): void {}
 }
killedBy: LoginComponent calls the auth service on submit and navigates to /home on success
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
app/auth/login/login.ts:31:9
   });
 
   protected onSubmit(): void {
-    if (this.form.invalid) {
+    if (true) {
       this.form.markAllAsTouched();
       return;
killedBy: LoginComponent calls the auth service on submit and navigates to /home on success
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
app/auth/login/login.ts:42:21
     this.authService.login(this.form.getRawValue())
       .pipe(takeUntilDestroyed(this.destroyRef))
       .subscribe({
-        next: () => {
-          const redirect = this.route.snapshot.queryParamMap.get('redirect') ?? '/home';
-          void this.router.navigateByUrl(redirect);
-        },
+        next: () => {},
         error: () => {
           this.errorMessage.set('Invalid email or password.');
killedBy: LoginComponent calls the auth service on submit and navigates to /home on success
statusReason: expected "navigateByUrl" to be called with arguments: [ '/home' ]

Number of calls: 0

[Killed] StringLiteral
app/auth/login/login.ts:43:81
       .pipe(takeUntilDestroyed(this.destroyRef))
       .subscribe({
         next: () => {
-          const redirect = this.route.snapshot.queryParamMap.get('redirect') ?? '/home';
+          const redirect = this.route.snapshot.queryParamMap.get('redirect') ?? "";
           void this.router.navigateByUrl(redirect);
         },
killedBy: LoginComponent calls the auth service on submit and navigates to /home on success
statusReason: expected "navigateByUrl" to be called with arguments: [ '/home' ]

Received:

  1st navigateByUrl call:

  [
-   "/home",

[Killed] BlockStatement
app/auth/login/login.ts:46:22
           const redirect = this.route.snapshot.queryParamMap.get('redirect') ?? '/home';
           void this.router.navigateByUrl(redirect);
         },
-        error: () => {
-          this.errorMessage.set('Invalid email or password.');
-          this.submitting.set(false);
-        }
+        error: () => {}
       });
   }
killedBy: LoginComponent shows an error message on a failed login
statusReason: expected null to be 'Invalid email or password.' // Object.is equality

[Survived] BooleanLiteral
app/auth/login/login.ts:48:31
         },
         error: () => {
           this.errorMessage.set('Invalid email or password.');
-          this.submitting.set(false);
+          this.submitting.set(true);
         }
       });
