[Survived] BooleanLiteral
app/interactions/interaction-form/interaction-form.ts:33:50
 
   protected readonly employees = signal<EmployeeProfileResponse[]>([]);
   protected readonly loadingEmployees = signal(true);
-  protected readonly loadingInteraction = signal(false);
+  protected readonly loadingInteraction = signal(true);
   protected readonly submitting = signal(false);
   protected readonly errorMessage = signal<string | null>(null);

[Killed] BooleanLiteral
app/interactions/interaction-form/interaction-form.ts:34:42
   protected readonly employees = signal<EmployeeProfileResponse[]>([]);
   protected readonly loadingEmployees = signal(true);
   protected readonly loadingInteraction = signal(false);
-  protected readonly submitting = signal(false);
+  protected readonly submitting = signal(true);
   protected readonly errorMessage = signal<string | null>(null);
   protected readonly interactionTypes = Object.values(InteractionType);
killedBy: InteractionFormComponent shows edit title and save button in edit mode
statusReason: expected 'Edit Interaction Subject *Select an e…' to contain 'Save Changes'

[Killed] ConditionalExpression
app/interactions/interaction-form/interaction-form.ts:50:50
       : undefined
   );
 
-  protected readonly isEditMode = computed(() => this.interactionId() !== undefined);
+  protected readonly isEditMode = computed(() => false);
 
   protected readonly form = new FormGroup<InteractionForm>({
killedBy: InteractionFormComponent loads existing interaction in edit mode and calls update on submit
statusReason: expected "vi.fn()" to be called with arguments: [ 10 ]

Number of calls: 0

[Killed] ConditionalExpression
app/interactions/interaction-form/interaction-form.ts:50:50
       : undefined
   );
 
-  protected readonly isEditMode = computed(() => this.interactionId() !== undefined);
+  protected readonly isEditMode = computed(() => true);
 
   protected readonly form = new FormGroup<InteractionForm>({
killedBy: InteractionFormComponent renders employee options and pre-selects subject from query param
statusReason: expected '' to be '2' // Object.is equality

[Survived] BooleanLiteral
app/interactions/interaction-form/interaction-form.ts:53:68
   protected readonly isEditMode = computed(() => this.interactionId() !== undefined);
 
   protected readonly form = new FormGroup<InteractionForm>({
-    subjectId: new FormControl<number | null>(null, { nonNullable: false, validators: [Validators.required] }),
+    subjectId: new FormControl<number | null>(null, { nonNullable: true, validators: [Validators.required] }),
     type: new FormControl<InteractionType>(InteractionType.NOTE, { nonNullable: true, validators: [Validators.required] }),
     date: new FormControl<string>('', { nonNullable: true, validators: [Validators.required] }),

[Killed] ObjectLiteral
app/interactions/interaction-form/interaction-form.ts:53:53
   protected readonly isEditMode = computed(() => this.interactionId() !== undefined);
 
   protected readonly form = new FormGroup<InteractionForm>({
-    subjectId: new FormControl<number | null>(null, { nonNullable: false, validators: [Validators.required] }),
+    subjectId: new FormControl<number | null>(null, {}),
     type: new FormControl<InteractionType>(InteractionType.NOTE, { nonNullable: true, validators: [Validators.required] }),
     date: new FormControl<string>('', { nonNullable: true, validators: [Validators.required] }),
killedBy: InteractionFormComponent marks required fields and shows validation errors after submit attempt
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
app/interactions/interaction-form/interaction-form.ts:56:27
     subjectId: new FormControl<number | null>(null, { nonNullable: false, validators: [Validators.required] }),
     type: new FormControl<InteractionType>(InteractionType.NOTE, { nonNullable: true, validators: [Validators.required] }),
     date: new FormControl<string>('', { nonNullable: true, validators: [Validators.required] }),
-    note: new FormControl('', { nonNullable: true, validators: [Validators.required] })
+    note: new FormControl("Stryker was here!", { nonNullable: true, validators: [Validators.required] })
   });
 

[Killed] BlockStatement
app/interactions/interaction-form/interaction-form.ts:61:28
 
   constructor() {
     const subjectId = this.subjectIdParam();
-    if (this.isEditMode()) {
-      this.loadingInteraction.set(true);
-      this.form.disable();
-      const id = this.interactionId();
-      if (id !== undefined) {
-        this.interactionService.findById(id)
-          .pipe(takeUntilDestroyed(this.destroyRef))
-          .subscribe({
-            next: interaction => {
-              this.patchForm(interaction);
-              this.loadingInteraction.set(false);
-              this.form.enable();
-              this.form.controls.subjectId.disable();
-            },
-            error: () => {
-              this.loadingInteraction.set(false);
-              this.form.enable();
-              this.errorMessage.set('Failed to load interaction.');
-            }
-          });
-      }
-    } else {
+    if (this.isEditMode()) {} else {
       if (subjectId !== undefined) {
         this.form.controls.subjectId.setValue(subjectId);
killedBy: InteractionFormComponent loads existing interaction in edit mode and calls update on submit
statusReason: expected "vi.fn()" to be called with arguments: [ 10 ]

Number of calls: 0

[Survived] BooleanLiteral
app/interactions/interaction-form/interaction-form.ts:62:35
   constructor() {
     const subjectId = this.subjectIdParam();
     if (this.isEditMode()) {
-      this.loadingInteraction.set(true);
+      this.loadingInteraction.set(false);
       this.form.disable();
       const id = this.interactionId();

[Killed] BlockStatement
app/interactions/interaction-form/interaction-form.ts:65:29
       this.loadingInteraction.set(true);
       this.form.disable();
       const id = this.interactionId();
-      if (id !== undefined) {
-        this.interactionService.findById(id)
-          .pipe(takeUntilDestroyed(this.destroyRef))
-          .subscribe({
-            next: interaction => {
-              this.patchForm(interaction);
-              this.loadingInteraction.set(false);
-              this.form.enable();
-              this.form.controls.subjectId.disable();
-            },
-            error: () => {
-              this.loadingInteraction.set(false);
-              this.form.enable();
-              this.errorMessage.set('Failed to load interaction.');
-            }
-          });
-      }
+      if (id !== undefined) {}
     } else {
       if (subjectId !== undefined) {
killedBy: InteractionFormComponent loads existing interaction in edit mode and calls update on submit
statusReason: expected "vi.fn()" to be called with arguments: [ 10 ]

Number of calls: 0

[Killed] BlockStatement
app/interactions/interaction-form/interaction-form.ts:69:34
         this.interactionService.findById(id)
           .pipe(takeUntilDestroyed(this.destroyRef))
           .subscribe({
-            next: interaction => {
-              this.patchForm(interaction);
-              this.loadingInteraction.set(false);
-              this.form.enable();
-              this.form.controls.subjectId.disable();
-            },
+            next: interaction => {},
             error: () => {
               this.loadingInteraction.set(false);
killedBy: InteractionFormComponent loads existing interaction in edit mode and calls update on submit
statusReason: expected "vi.fn()" to be called with arguments: [ 10, { subjectId: 2, …(3) } ]

Number of calls: 0

[Survived] BooleanLiteral
app/interactions/interaction-form/interaction-form.ts:71:43
           .subscribe({
             next: interaction => {
               this.patchForm(interaction);
-              this.loadingInteraction.set(false);
+              this.loadingInteraction.set(true);
               this.form.enable();
               this.form.controls.subjectId.disable();

[NoCoverage] BlockStatement
app/interactions/interaction-form/interaction-form.ts:75:26
               this.form.enable();
               this.form.controls.subjectId.disable();
             },
-            error: () => {
-              this.loadingInteraction.set(false);
-              this.form.enable();
-              this.errorMessage.set('Failed to load interaction.');
-            }
+            error: () => {}
           });
       }

[NoCoverage] BooleanLiteral
app/interactions/interaction-form/interaction-form.ts:76:43
               this.form.controls.subjectId.disable();
             },
             error: () => {
-              this.loadingInteraction.set(false);
+              this.loadingInteraction.set(true);
               this.form.enable();
               this.errorMessage.set('Failed to load interaction.');

[NoCoverage] StringLiteral
app/interactions/interaction-form/interaction-form.ts:78:37
             error: () => {
               this.loadingInteraction.set(false);
               this.form.enable();
-              this.errorMessage.set('Failed to load interaction.');
+              this.errorMessage.set("");
             }
           });

[Killed] BlockStatement
app/interactions/interaction-form/interaction-form.ts:82:12
             }
           });
       }
-    } else {
-      if (subjectId !== undefined) {
-        this.form.controls.subjectId.setValue(subjectId);
-        this.form.controls.subjectId.disable();
-      }
-
-      afterNextRender(() => {
-        this.form.controls.date.setValue(this.formatDate(new Date()));
-      });
-    }
+    } else {}
 
     this.employeeService.getAll()
killedBy: InteractionFormComponent renders employee options and pre-selects subject from query param
statusReason: expected '' to be '2' // Object.is equality

[Killed] BlockStatement
app/interactions/interaction-form/interaction-form.ts:83:36
           });
       }
     } else {
-      if (subjectId !== undefined) {
-        this.form.controls.subjectId.setValue(subjectId);
-        this.form.controls.subjectId.disable();
-      }
+      if (subjectId !== undefined) {}
 
       afterNextRender(() => {
killedBy: InteractionFormComponent renders employee options and pre-selects subject from query param
statusReason: expected '' to be '2' // Object.is equality

[Survived] BlockStatement
app/interactions/interaction-form/interaction-form.ts:88:29
         this.form.controls.subjectId.disable();
       }
 
-      afterNextRender(() => {
-        this.form.controls.date.setValue(this.formatDate(new Date()));
-      });
+      afterNextRender(() => {});
     }
 

[Killed] BlockStatement
app/interactions/interaction-form/interaction-form.ts:107:61
       });
   }
 
-  private patchForm(interaction: InteractionResponse): void {
-    this.form.patchValue({
-      subjectId: interaction.subject.id,
-      type: interaction.type,
-      date: interaction.date,
-      note: interaction.note
-    });
-  }
+  private patchForm(interaction: InteractionResponse): void {}
 
   protected onSubmit(): void {
killedBy: InteractionFormComponent loads existing interaction in edit mode and calls update on submit
statusReason: expected "vi.fn()" to be called with arguments: [ 10, { subjectId: 2, …(3) } ]

Number of calls: 0

[Killed] ObjectLiteral
app/interactions/interaction-form/interaction-form.ts:108:26
   }
 
   private patchForm(interaction: InteractionResponse): void {
-    this.form.patchValue({
-      subjectId: interaction.subject.id,
-      type: interaction.type,
-      date: interaction.date,
-      note: interaction.note
-    });
+    this.form.patchValue({});
   }
 
killedBy: InteractionFormComponent loads existing interaction in edit mode and calls update on submit
statusReason: expected "vi.fn()" to be called with arguments: [ 10, { subjectId: 2, …(3) } ]

Number of calls: 0

[Killed] EqualityOperator
app/interactions/interaction-form/interaction-form.ts:123:40
     }
 
     const rawValue = this.form.getRawValue();
-    if (rawValue.subjectId === null || rawValue.subjectId === undefined) {
+    if (rawValue.subjectId === null || rawValue.subjectId !== undefined) {
       return;
     }
killedBy: InteractionFormComponent submits valid interaction and navigates to subject timeline
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Survived] ConditionalExpression
app/interactions/interaction-form/interaction-form.ts:123:40
     }
 
     const rawValue = this.form.getRawValue();
-    if (rawValue.subjectId === null || rawValue.subjectId === undefined) {
+    if (rawValue.subjectId === null || false) {
       return;
     }

[Killed] ObjectLiteral
app/interactions/interaction-form/interaction-form.ts:144:18
 
     operation
       .pipe(takeUntilDestroyed(this.destroyRef))
-      .subscribe({
-        next: interaction => {
-          this.submitting.set(false);
-          void this.router.navigate(['/employees', interaction.subject.id, 'interactions']);
-        },
-        error: err => {
-          this.submitting.set(false);
-          this.errorMessage.set(this.extractErrorMessage(err));
-        }
-      });
+      .subscribe({});
   }
 
killedBy: InteractionFormComponent submits valid interaction and navigates to subject timeline
statusReason: expected "navigate" to be called with arguments: [ [ '/employees', 2, 'interactions' ] ]

Number of calls: 0

[Killed] BlockStatement
app/interactions/interaction-form/interaction-form.ts:145:30
     operation
       .pipe(takeUntilDestroyed(this.destroyRef))
       .subscribe({
-        next: interaction => {
-          this.submitting.set(false);
-          void this.router.navigate(['/employees', interaction.subject.id, 'interactions']);
-        },
+        next: interaction => {},
         error: err => {
           this.submitting.set(false);
killedBy: InteractionFormComponent submits valid interaction and navigates to subject timeline
statusReason: expected "navigate" to be called with arguments: [ [ '/employees', 2, 'interactions' ] ]

Number of calls: 0

[Survived] BooleanLiteral
app/interactions/interaction-form/interaction-form.ts:146:31
       .pipe(takeUntilDestroyed(this.destroyRef))
       .subscribe({
         next: interaction => {
-          this.submitting.set(false);
+          this.submitting.set(true);
           void this.router.navigate(['/employees', interaction.subject.id, 'interactions']);
         },

[Killed] StringLiteral
app/interactions/interaction-form/interaction-form.ts:147:38
       .subscribe({
         next: interaction => {
           this.submitting.set(false);
-          void this.router.navigate(['/employees', interaction.subject.id, 'interactions']);
+          void this.router.navigate(["", interaction.subject.id, 'interactions']);
         },
         error: err => {
killedBy: InteractionFormComponent submits valid interaction and navigates to subject timeline
statusReason: expected "navigate" to be called with arguments: [ [ '/employees', 2, 'interactions' ] ]

Received:

  1st navigate call:

  [
    [

[Killed] BlockStatement
app/interactions/interaction-form/interaction-form.ts:149:23
           this.submitting.set(false);
           void this.router.navigate(['/employees', interaction.subject.id, 'interactions']);
         },
-        error: err => {
-          this.submitting.set(false);
-          this.errorMessage.set(this.extractErrorMessage(err));
-        }
+        error: err => {}
       });
   }
killedBy: InteractionFormComponent displays error message when create fails
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Survived] BooleanLiteral
app/interactions/interaction-form/interaction-form.ts:150:31
           void this.router.navigate(['/employees', interaction.subject.id, 'interactions']);
         },
         error: err => {
-          this.submitting.set(false);
+          this.submitting.set(true);
           this.errorMessage.set(this.extractErrorMessage(err));
         }

[NoCoverage] BlockStatement
app/interactions/interaction-form/interaction-form.ts:156:28
       });
   }
 
-  protected cancel(): void {
-    const rawValue = this.form.getRawValue();
-    const subjectId = rawValue.subjectId ?? this.subjectIdParam();
-    void this.router.navigate(subjectId !== undefined && subjectId !== null
-      ? ['/employees', subjectId, 'interactions']
-      : ['/employees']
-    );
-  }
+  protected cancel(): void {}
 
   private formatDate(date: Date): string {

[NoCoverage] LogicalOperator
app/interactions/interaction-form/interaction-form.ts:158:23
 
   protected cancel(): void {
     const rawValue = this.form.getRawValue();
-    const subjectId = rawValue.subjectId ?? this.subjectIdParam();
+    const subjectId = rawValue.subjectId && this.subjectIdParam();
     void this.router.navigate(subjectId !== undefined && subjectId !== null
       ? ['/employees', subjectId, 'interactions']

[NoCoverage] ConditionalExpression
app/interactions/interaction-form/interaction-form.ts:159:31
   protected cancel(): void {
     const rawValue = this.form.getRawValue();
     const subjectId = rawValue.subjectId ?? this.subjectIdParam();
-    void this.router.navigate(subjectId !== undefined && subjectId !== null
+    void this.router.navigate(false
       ? ['/employees', subjectId, 'interactions']
       : ['/employees']

[NoCoverage] ConditionalExpression
app/interactions/interaction-form/interaction-form.ts:159:58
   protected cancel(): void {
     const rawValue = this.form.getRawValue();
     const subjectId = rawValue.subjectId ?? this.subjectIdParam();
-    void this.router.navigate(subjectId !== undefined && subjectId !== null
+    void this.router.navigate(subjectId !== undefined && true
       ? ['/employees', subjectId, 'interactions']
       : ['/employees']

[NoCoverage] ArrayDeclaration
app/interactions/interaction-form/interaction-form.ts:161:9
     const subjectId = rawValue.subjectId ?? this.subjectIdParam();
     void this.router.navigate(subjectId !== undefined && subjectId !== null
       ? ['/employees', subjectId, 'interactions']
-      : ['/employees']
+      : []
     );
   }

[Survived] ArithmeticOperator
app/interactions/interaction-form/interaction-form.ts:167:26
 
   private formatDate(date: Date): string {
     const year = date.getFullYear();
-    const month = String(date.getMonth() + 1).padStart(2, '0');
+    const month = String(date.getMonth() - 1).padStart(2, '0');
     const day = String(date.getDate()).padStart(2, '0');
     return `${year}-${month}-${day}`;

[Survived] StringLiteral
app/interactions/interaction-form/interaction-form.ts:168:52
   private formatDate(date: Date): string {
     const year = date.getFullYear();
     const month = String(date.getMonth() + 1).padStart(2, '0');
-    const day = String(date.getDate()).padStart(2, '0');
+    const day = String(date.getDate()).padStart(2, "");
     return `${year}-${month}-${day}`;
   }

[Survived] BlockStatement
app/interactions/interaction-form/interaction-form.ts:173:31
   }
 
   private extractErrorMessage(err: unknown): string {
-    if (err instanceof Error) {
-      return err.message;
-    }
+    if (err instanceof Error) {}
     if (typeof err === 'object' && err !== null && 'error' in err && typeof err.error === 'string') {
       return err.error;

[NoCoverage] BlockStatement
app/interactions/interaction-form/interaction-form.ts:176:101
     if (err instanceof Error) {
       return err.message;
     }
-    if (typeof err === 'object' && err !== null && 'error' in err && typeof err.error === 'string') {
-      return err.error;
-    }
+    if (typeof err === 'object' && err !== null && 'error' in err && typeof err.error === 'string') {}
     if (typeof err === 'object' && err !== null && 'message' in err && typeof err.message === 'string') {
       return err.message;

[NoCoverage] BlockStatement
app/interactions/interaction-form/interaction-form.ts:179:105
     if (typeof err === 'object' && err !== null && 'error' in err && typeof err.error === 'string') {
       return err.error;
     }
-    if (typeof err === 'object' && err !== null && 'message' in err && typeof err.message === 'string') {
-      return err.message;
-    }
+    if (typeof err === 'object' && err !== null && 'message' in err && typeof err.message === 'string') {}
     return 'Failed to save interaction. Please try again.';
   }
