[Killed] ArrowFunction
src/app/auth/auth.service.ts:25:39
   private readonly currentUserSignal = signal<EmployeeResponse | null>(null);
 
   readonly currentUser = this.currentUserSignal.asReadonly();
-  readonly isAuthenticated = computed(() => this.tokenSignal() !== null);
+  readonly isAuthenticated = computed(() => undefined);
 
   login(credentials: LoginRequest): Observable<AuthResponse> {
killedBy: authGuard allows activation when authenticated
statusReason: expected RedirectCommand{ …(2) } to be true // Object.is equality

[Killed] ConditionalExpression
src/app/auth/auth.service.ts:25:45
   private readonly currentUserSignal = signal<EmployeeResponse | null>(null);
 
   readonly currentUser = this.currentUserSignal.asReadonly();
-  readonly isAuthenticated = computed(() => this.tokenSignal() !== null);
+  readonly isAuthenticated = computed(() => false);
 
   login(credentials: LoginRequest): Observable<AuthResponse> {
killedBy: authInterceptor adds Bearer token when authenticated
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/app/auth/auth.service.ts:29:23
 
   login(credentials: LoginRequest): Observable<AuthResponse> {
     return this.http.post<AuthResponse>(`${this.apiUrl}/auth/login`, credentials).pipe(
-      tap(response => {
-        this.setToken(response.token);
-        this.currentUserSignal.set({
-          id: response.employeeId,
-          email: response.email,
-          firstName: response.firstName,
-          lastName: response.lastName
-        });
-      })
+      tap(response => {})
     );
   }
killedBy: authInterceptor adds Bearer token when authenticated
statusReason: expected false to be true // Object.is equality

[Survived] ArrowFunction
src/app/auth/auth.service.ts:43:11
 
   loadCurrentUser(): Observable<EmployeeResponse> {
     return this.http.get<EmployeeResponse>(`${this.apiUrl}/auth/me`).pipe(
-      tap(user => this.currentUserSignal.set(user))
+      tap(() => undefined)
     );
   }

[Killed] BlockStatement
src/app/auth/auth.service.ts:47:18
     );
   }
 
-  logout(): void {
-    localStorage.removeItem(TOKEN_KEY);
-    this.tokenSignal.set(null);
-    this.currentUserSignal.set(null);
-  }
+  logout(): void {}
 
   getToken(): string | null {
killedBy: authInterceptor logs out and redirects to /login on a 401
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/app/auth/auth.service.ts:57:41
     return this.tokenSignal();
   }
 
-  private setToken(token: string): void {
-    localStorage.setItem(TOKEN_KEY, token);
-    this.tokenSignal.set(token);
-  }
+  private setToken(token: string): void {}
 }
killedBy: authInterceptor adds Bearer token when authenticated
statusReason: expected false to be true // Object.is equality
