[Survived] BooleanLiteral
app/tasks/my-tasks/my-tasks.ts:19:39
   private readonly destroyRef = inject(DestroyRef);
 
   protected readonly tasks = signal<Task[]>([]);
-  protected readonly loading = signal(true);
+  protected readonly loading = signal(false);
   protected readonly errorMessage = signal<string | null>(null);
   protected readonly markingDoneId = signal<number | null>(null);

[Killed] ArrowFunction
app/tasks/my-tasks/my-tasks.ts:23:43
   protected readonly errorMessage = signal<string | null>(null);
   protected readonly markingDoneId = signal<number | null>(null);
 
-  protected readonly openTasks = computed(() => this.tasks().filter(t => t.status === 'OPEN'));
+  protected readonly openTasks = computed(() => undefined);
   protected readonly doneTasks = computed(() => this.tasks().filter(t => t.status === 'DONE'));
 
killedBy: MyTasksComponent renders open and done task lists
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
app/tasks/my-tasks/my-tasks.ts:23:74
   protected readonly errorMessage = signal<string | null>(null);
   protected readonly markingDoneId = signal<number | null>(null);
 
-  protected readonly openTasks = computed(() => this.tasks().filter(t => t.status === 'OPEN'));
+  protected readonly openTasks = computed(() => this.tasks().filter(t => true));
   protected readonly doneTasks = computed(() => this.tasks().filter(t => t.status === 'DONE'));
 
killedBy: MyTasksComponent places open tasks in the Open section and done tasks in the Done section
statusReason: expected 'OpenOpen task Relates to: A B  Mark d…' not to contain 'Done task'

[Killed] ArrowFunction
app/tasks/my-tasks/my-tasks.ts:24:43
   protected readonly markingDoneId = signal<number | null>(null);
 
   protected readonly openTasks = computed(() => this.tasks().filter(t => t.status === 'OPEN'));
-  protected readonly doneTasks = computed(() => this.tasks().filter(t => t.status === 'DONE'));
+  protected readonly doneTasks = computed(() => undefined);
 
   constructor() {
killedBy: MyTasksComponent renders open and done task lists
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ArrowFunction
app/tasks/my-tasks/my-tasks.ts:24:69
   protected readonly markingDoneId = signal<number | null>(null);
 
   protected readonly openTasks = computed(() => this.tasks().filter(t => t.status === 'OPEN'));
-  protected readonly doneTasks = computed(() => this.tasks().filter(t => t.status === 'DONE'));
+  protected readonly doneTasks = computed(() => this.tasks().filter(() => undefined));
 
   constructor() {
killedBy: MyTasksComponent renders open and done task lists
statusReason: expected null to be truthy

[Killed] BlockStatement
app/tasks/my-tasks/my-tasks.ts:26:17
   protected readonly openTasks = computed(() => this.tasks().filter(t => t.status === 'OPEN'));
   protected readonly doneTasks = computed(() => this.tasks().filter(t => t.status === 'DONE'));
 
-  constructor() {
-    this.loadTasks();
-  }
+  constructor() {}
 
   private loadTasks(): void {
killedBy: MyTasksComponent renders open and done task lists
statusReason: expected null to be truthy

[Killed] BlockStatement
app/tasks/my-tasks/my-tasks.ts:30:29
     this.loadTasks();
   }
 
-  private loadTasks(): void {
-    this.loading.set(true);
-    this.errorMessage.set(null);
-    this.taskService.getMyTasks()
-      .pipe(takeUntilDestroyed(this.destroyRef))
-      .subscribe({
-        next: tasks => {
-          this.tasks.set(tasks);
-          this.loading.set(false);
-        },
-        error: () => {
-          this.loading.set(false);
-          this.errorMessage.set('Failed to load tasks. Please try again.');
-        }
-      });
-  }
+  private loadTasks(): void {}
 
   protected markDone(task: Task): void {
killedBy: MyTasksComponent renders open and done task lists
statusReason: expected null to be truthy

[Killed] BooleanLiteral
app/tasks/my-tasks/my-tasks.ts:31:22
   }
 
   private loadTasks(): void {
-    this.loading.set(true);
+    this.loading.set(false);
     this.errorMessage.set(null);
     this.taskService.getMyTasks()
killedBy: MyTasksComponent sets loading to true while tasks are being fetched and false once loaded
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
app/tasks/my-tasks/my-tasks.ts:36:24
     this.taskService.getMyTasks()
       .pipe(takeUntilDestroyed(this.destroyRef))
       .subscribe({
-        next: tasks => {
-          this.tasks.set(tasks);
-          this.loading.set(false);
-        },
+        next: tasks => {},
         error: () => {
           this.loading.set(false);
killedBy: MyTasksComponent renders open and done task lists
statusReason: expected null to be truthy

[Killed] BooleanLiteral
app/tasks/my-tasks/my-tasks.ts:38:28
       .subscribe({
         next: tasks => {
           this.tasks.set(tasks);
-          this.loading.set(false);
+          this.loading.set(true);
         },
         error: () => {
killedBy: MyTasksComponent renders open and done task lists
statusReason: expected null to be truthy

[Killed] BlockStatement
app/tasks/my-tasks/my-tasks.ts:40:22
           this.tasks.set(tasks);
           this.loading.set(false);
         },
-        error: () => {
-          this.loading.set(false);
-          this.errorMessage.set('Failed to load tasks. Please try again.');
-        }
+        error: () => {}
       });
   }
killedBy: MyTasksComponent shows error message when getMyTasks fails
statusReason: expected '← HomeMy Tasks New Task Loading…' to contain 'Failed to load tasks'

[Killed] BooleanLiteral
app/tasks/my-tasks/my-tasks.ts:41:28
           this.loading.set(false);
         },
         error: () => {
-          this.loading.set(false);
+          this.loading.set(true);
           this.errorMessage.set('Failed to load tasks. Please try again.');
         }
killedBy: MyTasksComponent shows error message when getMyTasks fails
statusReason: expected '← HomeMy Tasks New Task Loading…' to contain 'Failed to load tasks'

[Killed] BlockStatement
app/tasks/my-tasks/my-tasks.ts:47:40
       });
   }
 
-  protected markDone(task: Task): void {
-    this.markingDoneId.set(task.id);
-    this.errorMessage.set(null);
-    this.taskService.updateStatus(task.id, { status: 'DONE' })
-      .pipe(takeUntilDestroyed(this.destroyRef))
-      .subscribe({
-        next: updated => {
-          this.tasks.update(list => list.map(t => t.id === updated.id ? updated : t));
-          this.markingDoneId.set(null);
-        },
-        error: () => {
-          this.markingDoneId.set(null);
-          this.errorMessage.set('Failed to update task. Please try again.');
-        }
-      });
-  }
+  protected markDone(task: Task): void {}
 }
 
killedBy: MyTasksComponent markDone() calls updateStatus and updates the task in the list
statusReason: expected "vi.fn()" to be called with arguments: [ 1, { status: 'DONE' } ]

Number of calls: 0

[Killed] ObjectLiteral
app/tasks/my-tasks/my-tasks.ts:52:18
     this.errorMessage.set(null);
     this.taskService.updateStatus(task.id, { status: 'DONE' })
       .pipe(takeUntilDestroyed(this.destroyRef))
-      .subscribe({
-        next: updated => {
-          this.tasks.update(list => list.map(t => t.id === updated.id ? updated : t));
-          this.markingDoneId.set(null);
-        },
-        error: () => {
-          this.markingDoneId.set(null);
-          this.errorMessage.set('Failed to update task. Please try again.');
-        }
-      });
+      .subscribe({});
   }
 }
killedBy: MyTasksComponent markDone() only replaces the targeted task when multiple tasks are open
statusReason: expected [ { id: 1, …(10) }, { id: 2, …(10) } ] to have a length of 1 but got 2

[Killed] BlockStatement
app/tasks/my-tasks/my-tasks.ts:53:26
     this.taskService.updateStatus(task.id, { status: 'DONE' })
       .pipe(takeUntilDestroyed(this.destroyRef))
       .subscribe({
-        next: updated => {
-          this.tasks.update(list => list.map(t => t.id === updated.id ? updated : t));
-          this.markingDoneId.set(null);
-        },
+        next: updated => {},
         error: () => {
           this.markingDoneId.set(null);
killedBy: MyTasksComponent markDone() only replaces the targeted task when multiple tasks are open
statusReason: expected [ { id: 1, …(10) }, { id: 2, …(10) } ] to have a length of 1 but got 2

[Killed] ConditionalExpression
app/tasks/my-tasks/my-tasks.ts:54:51
       .pipe(takeUntilDestroyed(this.destroyRef))
       .subscribe({
         next: updated => {
-          this.tasks.update(list => list.map(t => t.id === updated.id ? updated : t));
+          this.tasks.update(list => list.map(t => false ? updated : t));
           this.markingDoneId.set(null);
         },
killedBy: MyTasksComponent markDone() only replaces the targeted task when multiple tasks are open
statusReason: expected [ { id: 1, …(10) }, { id: 2, …(10) } ] to have a length of 1 but got 2

[Killed] EqualityOperator
app/tasks/my-tasks/my-tasks.ts:54:51
       .pipe(takeUntilDestroyed(this.destroyRef))
       .subscribe({
         next: updated => {
-          this.tasks.update(list => list.map(t => t.id === updated.id ? updated : t));
+          this.tasks.update(list => list.map(t => t.id !== updated.id ? updated : t));
           this.markingDoneId.set(null);
         },
killedBy: MyTasksComponent markDone() only replaces the targeted task when multiple tasks are open
statusReason: expected 1 to be 2 // Object.is equality

[NoCoverage] BlockStatement
app/tasks/my-tasks/my-tasks.ts:57:22
           this.tasks.update(list => list.map(t => t.id === updated.id ? updated : t));
           this.markingDoneId.set(null);
         },
-        error: () => {
-          this.markingDoneId.set(null);
-          this.errorMessage.set('Failed to update task. Please try again.');
-        }
+        error: () => {}
       });
   }
