[Killed] StringLiteral
app/interactions/interaction-timeline/interaction-timeline.ts:33:81
   private readonly router = inject(Router);
   private readonly destroyRef = inject(DestroyRef);
 
-  protected readonly subjectId = signal(Number(this.route.snapshot.paramMap.get('id')));
+  protected readonly subjectId = signal(Number(this.route.snapshot.paramMap.get("")));
   protected readonly employee = signal<EmployeeProfileResponse | null>(null);
   protected readonly interactions = signal<InteractionResponse[]>([]);
killedBy: InteractionTimelineComponent loads employee and interactions on init
statusReason: expected "vi.fn()" to be called with arguments: [ 2 ]

Number of calls: 0

[Survived] BooleanLiteral
app/interactions/interaction-timeline/interaction-timeline.ts:37:39
   protected readonly employee = signal<EmployeeProfileResponse | null>(null);
   protected readonly interactions = signal<InteractionResponse[]>([]);
   protected readonly employees = signal<EmployeeProfileResponse[]>([]);
-  protected readonly loading = signal(true);
+  protected readonly loading = signal(false);
   protected readonly errorMessage = signal<string | null>(null);
   protected readonly deletingId = signal<number | null>(null);

[Killed] BlockStatement
app/interactions/interaction-timeline/interaction-timeline.ts:49:58
   protected readonly currentUser = this.authService.currentUser;
   protected readonly interactionTypes = Object.values(InteractionType);
 
-  protected readonly sortedInteractions = computed(() => {
-    return [...this.interactions()].sort(
-      (a, b) => new Date(b.date).getTime() - new Date(a.date).getTime()
-    );
-  });
+  protected readonly sortedInteractions = computed(() => {});
 
   constructor() {
killedBy: InteractionTimelineComponent loads employee and interactions on init
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] MethodExpression
app/interactions/interaction-timeline/interaction-timeline.ts:50:12
   protected readonly interactionTypes = Object.values(InteractionType);
 
   protected readonly sortedInteractions = computed(() => {
-    return [...this.interactions()].sort(
-      (a, b) => new Date(b.date).getTime() - new Date(a.date).getTime()
-    );
+    return [...this.interactions()];
   });
 
killedBy: InteractionTimelineComponent sorts interactions by date descending
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ArithmeticOperator
app/interactions/interaction-timeline/interaction-timeline.ts:51:17
 
   protected readonly sortedInteractions = computed(() => {
     return [...this.interactions()].sort(
-      (a, b) => new Date(b.date).getTime() - new Date(a.date).getTime()
+      (a, b) => new Date(b.date).getTime() + new Date(a.date).getTime()
     );
   });
killedBy: InteractionTimelineComponent sorts interactions by date descending
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BooleanLiteral
app/interactions/interaction-timeline/interaction-timeline.ts:57:9
 
   constructor() {
     const id = this.subjectId();
-    if (!Number.isFinite(id) || id <= 0) {
+    if (Number.isFinite(id) || id <= 0) {
       this.loading.set(false);
       this.errorMessage.set('Invalid employee id.');
killedBy: InteractionTimelineComponent loads employee and interactions on init
statusReason: expected "vi.fn()" to be called with arguments: [ 2 ]

Number of calls: 0

[Killed] EqualityOperator
app/interactions/interaction-timeline/interaction-timeline.ts:57:33
 
   constructor() {
     const id = this.subjectId();
-    if (!Number.isFinite(id) || id <= 0) {
+    if (!Number.isFinite(id) || id < 0) {
       this.loading.set(false);
       this.errorMessage.set('Invalid employee id.');
killedBy: InteractionTimelineComponent shows error and skips service calls when the route id is invalid (0)
statusReason: expected '← Employees Interactions with Bob Jon…' to contain 'Invalid employee id'

[Killed] BooleanLiteral
app/interactions/interaction-timeline/interaction-timeline.ts:58:24
   constructor() {
     const id = this.subjectId();
     if (!Number.isFinite(id) || id <= 0) {
-      this.loading.set(false);
+      this.loading.set(true);
       this.errorMessage.set('Invalid employee id.');
       return;
killedBy: InteractionTimelineComponent shows error and skips service calls when the route id is invalid (0)
statusReason: expected 'Loading…' to contain 'Invalid employee id'

[NoCoverage] BlockStatement
app/interactions/interaction-timeline/interaction-timeline.ts:63:38
       return;
     }
 
-    if (this.currentUser() === null) {
-      this.authService.loadCurrentUser()
-        .pipe(takeUntilDestroyed(this.destroyRef))
-        .subscribe({ error: () => { /* best-effort */ } });
-    }
+    if (this.currentUser() === null) {}
 
     this.employeeService.getAll()

[Survived] EqualityOperator
app/interactions/interaction-timeline/interaction-timeline.ts:63:9
       return;
     }
 
-    if (this.currentUser() === null) {
+    if (this.currentUser() !== null) {
       this.authService.loadCurrentUser()
         .pipe(takeUntilDestroyed(this.destroyRef))

[NoCoverage] StringLiteral
app/interactions/interaction-timeline/interaction-timeline.ts:72:33
     this.employeeService.getAll()
       .pipe(
         catchError(() => {
-          this.errorMessage.set('Failed to load employees for filter.');
+          this.errorMessage.set("");
           return EMPTY;
         }),

[Survived] ArrowFunction
app/interactions/interaction-timeline/interaction-timeline.ts:77:18
         }),
         takeUntilDestroyed(this.destroyRef)
       )
-      .subscribe(employees => this.employees.set(employees));
+      .subscribe(() => undefined);
 
     this.loadInteractions(id);

[Killed] BlockStatement
app/interactions/interaction-timeline/interaction-timeline.ts:82:74
     this.loadInteractions(id);
   }
 
-  private loadInteractions(id: number, filter?: InteractionFilter): void {
-    this.loading.set(true);
-    this.errorMessage.set(null);
-
-    forkJoin({
-      employee: this.employeeService.getProfile(id),
-      interactions: this.interactionService.findBySubject(id, filter)
-    })
-      .pipe(
-        catchError(() => {
-          this.loading.set(false);
-          this.errorMessage.set('Failed to load interactions.');
-          return EMPTY;
-        }),
-        takeUntilDestroyed(this.destroyRef)
-      )
-      .subscribe(result => {
-        this.employee.set(result.employee);
-        this.interactions.set(result.interactions);
-        this.loading.set(false);
-      });
-  }
+  private loadInteractions(id: number, filter?: InteractionFilter): void {}
 
   protected applyFilters(): void {
killedBy: InteractionTimelineComponent loads employee and interactions on init
statusReason: expected "vi.fn()" to be called with arguments: [ 2 ]

Number of calls: 0

[Survived] BooleanLiteral
app/interactions/interaction-timeline/interaction-timeline.ts:83:22
   }
 
   private loadInteractions(id: number, filter?: InteractionFilter): void {
-    this.loading.set(true);
+    this.loading.set(false);
     this.errorMessage.set(null);
 

[Killed] BooleanLiteral
app/interactions/interaction-timeline/interaction-timeline.ts:92:28
     })
       .pipe(
         catchError(() => {
-          this.loading.set(false);
+          this.loading.set(true);
           this.errorMessage.set('Failed to load interactions.');
           return EMPTY;
killedBy: InteractionTimelineComponent displays error when interaction load fails
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BlockStatement
app/interactions/interaction-timeline/interaction-timeline.ts:98:28
         }),
         takeUntilDestroyed(this.destroyRef)
       )
-      .subscribe(result => {
-        this.employee.set(result.employee);
-        this.interactions.set(result.interactions);
-        this.loading.set(false);
-      });
+      .subscribe(result => {});
   }
 
killedBy: InteractionTimelineComponent loads employee and interactions on init
statusReason: expected 'Loading…' to contain 'Interactions with Bob Jones'

[Killed] BooleanLiteral
app/interactions/interaction-timeline/interaction-timeline.ts:101:26
       .subscribe(result => {
         this.employee.set(result.employee);
         this.interactions.set(result.interactions);
-        this.loading.set(false);
+        this.loading.set(true);
       });
   }
killedBy: InteractionTimelineComponent loads employee and interactions on init
statusReason: expected 'Loading…' to contain 'Interactions with Bob Jones'

[Killed] BlockStatement
app/interactions/interaction-timeline/interaction-timeline.ts:105:34
       });
   }
 
-  protected applyFilters(): void {
-    this.loadInteractions(this.subjectId(), this.filterForm.getRawValue());
-  }
+  protected applyFilters(): void {}
 
   protected resetFilters(): void {
killedBy: InteractionTimelineComponent applyFilters() calls service with selected filters
statusReason: expected "vi.fn()" to be called with arguments: [ 2, { type: 'CALL', …(2) } ]

Received:

  1st vi.fn() call:

  [
    2,

[Survived] BlockStatement
app/interactions/interaction-timeline/interaction-timeline.ts:109:34
     this.loadInteractions(this.subjectId(), this.filterForm.getRawValue());
   }
 
-  protected resetFilters(): void {
-    this.filterForm.reset({ type: null, authorId: null, date: null });
-    this.loadInteractions(this.subjectId());
-  }
+  protected resetFilters(): void {}
 
   protected isAuthor(interaction: InteractionResponse): boolean {

[Killed] ConditionalExpression
app/interactions/interaction-timeline/interaction-timeline.ts:116:12
 
   protected isAuthor(interaction: InteractionResponse): boolean {
     const user = this.currentUser();
-    return user !== null && interaction.author.id === user.id;
+    return false;
   }
 
killedBy: InteractionTimelineComponent shows edit and delete buttons for own interactions
statusReason: expected ' CALL 2026/06/25 Create task Newer no…' to contain 'Edit'

[Killed] EqualityOperator
app/interactions/interaction-timeline/interaction-timeline.ts:116:29
 
   protected isAuthor(interaction: InteractionResponse): boolean {
     const user = this.currentUser();
-    return user !== null && interaction.author.id === user.id;
+    return user !== null && interaction.author.id !== user.id;
   }
 
killedBy: InteractionTimelineComponent shows edit and delete buttons for own interactions
statusReason: expected ' CALL 2026/06/25 Create task Newer no…' to contain 'Edit'

[Killed] BlockStatement
app/interactions/interaction-timeline/interaction-timeline.ts:119:36
     return user !== null && interaction.author.id === user.id;
   }
 
-  protected logInteraction(): void {
-    void this.router.navigate(['/interactions/new'], { queryParams: { subjectId: this.subjectId() } });
-  }
+  protected logInteraction(): void {}
 
   protected editInteraction(interaction: InteractionResponse): void {
killedBy: InteractionTimelineComponent navigates to log form with subjectId query param
statusReason: expected "navigate" to be called with arguments: [ [ '/interactions/new' ], …(1) ]

Number of calls: 0

[Killed] ObjectLiteral
app/interactions/interaction-timeline/interaction-timeline.ts:120:69
   }
 
   protected logInteraction(): void {
-    void this.router.navigate(['/interactions/new'], { queryParams: { subjectId: this.subjectId() } });
+    void this.router.navigate(['/interactions/new'], { queryParams: {} });
   }
 
killedBy: InteractionTimelineComponent navigates to log form with subjectId query param
statusReason: expected "navigate" to be called with arguments: [ [ '/interactions/new' ], …(1) ]

Received:

  1st navigate call:

  [
    [

[Killed] StringLiteral
app/interactions/interaction-timeline/interaction-timeline.ts:120:32
   }
 
   protected logInteraction(): void {
-    void this.router.navigate(['/interactions/new'], { queryParams: { subjectId: this.subjectId() } });
+    void this.router.navigate([""], { queryParams: { subjectId: this.subjectId() } });
   }
 
killedBy: InteractionTimelineComponent navigates to log form with subjectId query param
statusReason: expected "navigate" to be called with arguments: [ [ '/interactions/new' ], …(1) ]

Received:

  1st navigate call:

@@ -1,8 +1,8 @@
  [

[Killed] BlockStatement
app/interactions/interaction-timeline/interaction-timeline.ts:123:69
     void this.router.navigate(['/interactions/new'], { queryParams: { subjectId: this.subjectId() } });
   }
 
-  protected editInteraction(interaction: InteractionResponse): void {
-    void this.router.navigate(['/interactions', interaction.id, 'edit']);
-  }
+  protected editInteraction(interaction: InteractionResponse): void {}
 
   protected createTaskFromInteraction(interaction: InteractionResponse): void {
killedBy: InteractionTimelineComponent navigates to edit route when edit is clicked
statusReason: expected "navigate" to be called with arguments: [ [ '/interactions', 1, 'edit' ] ]

Number of calls: 0

[NoCoverage] BlockStatement
app/interactions/interaction-timeline/interaction-timeline.ts:127:79
     void this.router.navigate(['/interactions', interaction.id, 'edit']);
   }
 
-  protected createTaskFromInteraction(interaction: InteractionResponse): void {
-    void this.router.navigate(['/interactions', interaction.id, 'create-task']);
-  }
+  protected createTaskFromInteraction(interaction: InteractionResponse): void {}
 
   protected deleteInteraction(interaction: InteractionResponse): void {

[NoCoverage] StringLiteral
app/interactions/interaction-timeline/interaction-timeline.ts:128:65
   }
 
   protected createTaskFromInteraction(interaction: InteractionResponse): void {
-    void this.router.navigate(['/interactions', interaction.id, 'create-task']);
+    void this.router.navigate(['/interactions', interaction.id, ""]);
   }
 

[NoCoverage] ArrayDeclaration
app/interactions/interaction-timeline/interaction-timeline.ts:128:31
   }
 
   protected createTaskFromInteraction(interaction: InteractionResponse): void {
-    void this.router.navigate(['/interactions', interaction.id, 'create-task']);
+    void this.router.navigate([]);
   }
 

[Killed] BlockStatement
app/interactions/interaction-timeline/interaction-timeline.ts:131:71
     void this.router.navigate(['/interactions', interaction.id, 'create-task']);
   }
 
-  protected deleteInteraction(interaction: InteractionResponse): void {
-    if (!this.isAuthor(interaction)) {
-      return;
-    }
-    if (!confirm('Are you sure you want to delete this interaction?')) {
-      return;
-    }
-
-    this.deletingId.set(interaction.id);
-    this.errorMessage.set(null);
-
-    this.interactionService.delete(interaction.id)
-      .pipe(takeUntilDestroyed(this.destroyRef))
-      .subscribe({
-        next: () => {
-          this.deletingId.set(null);
-          this.interactions.update(list => list.filter(i => i.id !== interaction.id));
-        },
-        error: () => {
-          this.deletingId.set(null);
-          this.errorMessage.set('Failed to delete interaction. Please try again.');
-        }
-      });
-  }
+  protected deleteInteraction(interaction: InteractionResponse): void {}
 
   protected formatDate(isoDate: string): string {
killedBy: InteractionTimelineComponent calls delete service and removes interaction from list when delete is confirmed
statusReason: expected "bound " to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] ConditionalExpression
app/interactions/interaction-timeline/interaction-timeline.ts:132:9
   }
 
   protected deleteInteraction(interaction: InteractionResponse): void {
-    if (!this.isAuthor(interaction)) {
+    if (true) {
       return;
     }
killedBy: InteractionTimelineComponent calls delete service and removes interaction from list when delete is confirmed
statusReason: expected "bound " to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BooleanLiteral
app/interactions/interaction-timeline/interaction-timeline.ts:132:9
   }
 
   protected deleteInteraction(interaction: InteractionResponse): void {
-    if (!this.isAuthor(interaction)) {
+    if (this.isAuthor(interaction)) {
       return;
     }
killedBy: InteractionTimelineComponent calls delete service and removes interaction from list when delete is confirmed
statusReason: expected "bound " to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BlockStatement
app/interactions/interaction-timeline/interaction-timeline.ts:135:72
     if (!this.isAuthor(interaction)) {
       return;
     }
-    if (!confirm('Are you sure you want to delete this interaction?')) {
-      return;
-    }
+    if (!confirm('Are you sure you want to delete this interaction?')) {}
 
     this.deletingId.set(interaction.id);
killedBy: InteractionTimelineComponent does not delete when confirmation is cancelled
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      1,

[Killed] ConditionalExpression
app/interactions/interaction-timeline/interaction-timeline.ts:135:9
     if (!this.isAuthor(interaction)) {
       return;
     }
-    if (!confirm('Are you sure you want to delete this interaction?')) {
+    if (true) {
       return;
     }
killedBy: InteractionTimelineComponent calls delete service and removes interaction from list when delete is confirmed
statusReason: expected "bound " to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BlockStatement
app/interactions/interaction-timeline/interaction-timeline.ts:145:21
     this.interactionService.delete(interaction.id)
       .pipe(takeUntilDestroyed(this.destroyRef))
       .subscribe({
-        next: () => {
-          this.deletingId.set(null);
-          this.interactions.update(list => list.filter(i => i.id !== interaction.id));
-        },
+        next: () => {},
         error: () => {
           this.deletingId.set(null);
killedBy: InteractionTimelineComponent calls delete service and removes interaction from list when delete is confirmed
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ArrowFunction
app/interactions/interaction-timeline/interaction-timeline.ts:147:56
       .subscribe({
         next: () => {
           this.deletingId.set(null);
-          this.interactions.update(list => list.filter(i => i.id !== interaction.id));
+          this.interactions.update(list => list.filter(() => undefined));
         },
         error: () => {
killedBy: InteractionTimelineComponent calls delete service and removes interaction from list when delete is confirmed
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
app/interactions/interaction-timeline/interaction-timeline.ts:147:61
       .subscribe({
         next: () => {
           this.deletingId.set(null);
-          this.interactions.update(list => list.filter(i => i.id !== interaction.id));
+          this.interactions.update(list => list.filter(i => i.id === interaction.id));
         },
         error: () => {
killedBy: InteractionTimelineComponent calls delete service and removes interaction from list when delete is confirmed
statusReason: expected ' NOTE 2026/06/20 Create task  Edit  D…' to contain 'Newer note'

[NoCoverage] BlockStatement
app/interactions/interaction-timeline/interaction-timeline.ts:149:22
           this.deletingId.set(null);
           this.interactions.update(list => list.filter(i => i.id !== interaction.id));
         },
-        error: () => {
-          this.deletingId.set(null);
-          this.errorMessage.set('Failed to delete interaction. Please try again.');
-        }
+        error: () => {}
       });
   }
