[Killed] StringLiteral
app/tasks/create-task-from-interaction/create-task-from-interaction.ts:37:28
   protected readonly errorMessage = signal<string | null>(null);
 
   protected readonly form = new FormGroup<CreateFromInteractionForm>({
-    title: new FormControl('', { nonNullable: true, validators: [Validators.required] }),
+    title: new FormControl("Stryker was here!", { nonNullable: true, validators: [Validators.required] }),
     description: new FormControl('', { nonNullable: true }),
     dueDate: new FormControl('', { nonNullable: true }),
killedBy: CreateTaskFromInteractionComponent with a valid interaction id shows validation error when title is empty on submit
statusReason: expected '← BackCreate Follow-up TaskTitle *Des…' to contain 'Title is required'

[Survived] StringLiteral
app/tasks/create-task-from-interaction/create-task-from-interaction.ts:38:34
 
   protected readonly form = new FormGroup<CreateFromInteractionForm>({
     title: new FormControl('', { nonNullable: true, validators: [Validators.required] }),
-    description: new FormControl('', { nonNullable: true }),
+    description: new FormControl("Stryker was here!", { nonNullable: true }),
     dueDate: new FormControl('', { nonNullable: true }),
     assigneeId: new FormControl<number | null>(null)

[Killed] BlockStatement
app/tasks/create-task-from-interaction/create-task-from-interaction.ts:43:17
     assigneeId: new FormControl<number | null>(null)
   });
 
-  constructor() {
-    if (!Number.isFinite(this.interactionId()) || this.interactionId() <= 0) {
-      this.loadingEmployees.set(false);
-      this.errorMessage.set('Invalid interaction reference. Please go back and try again.');
-      return;
-    }
-
-    this.employeeService.getAll()
-      .pipe(takeUntilDestroyed(this.destroyRef))
-      .subscribe({
-        next: list => {
-          this.employees.set(list);
-          this.loadingEmployees.set(false);
-        },
-        error: () => {
-          this.loadingEmployees.set(false);
-          this.errorMessage.set('Failed to load employees.');
-        }
-      });
-  }
+  constructor() {}
 
   protected onSubmit(): void {
killedBy: CreateTaskFromInteractionComponent with a valid interaction id shows error message when employee list fails to load
statusReason: expected '← BackCreate Follow-up TaskTitle *Des…' to contain 'Failed to load employees'

[Killed] BlockStatement
app/tasks/create-task-from-interaction/create-task-from-interaction.ts:44:78
   });
 
   constructor() {
-    if (!Number.isFinite(this.interactionId()) || this.interactionId() <= 0) {
-      this.loadingEmployees.set(false);
-      this.errorMessage.set('Invalid interaction reference. Please go back and try again.');
-      return;
-    }
+    if (!Number.isFinite(this.interactionId()) || this.interactionId() <= 0) {}
 
     this.employeeService.getAll()
killedBy: CreateTaskFromInteractionComponent with an invalid interaction id shows an error and does not call the employee service
statusReason: expected '← BackCreate Follow-up TaskTitle *Des…' to contain 'Invalid interaction reference'

[Killed] EqualityOperator
app/tasks/create-task-from-interaction/create-task-from-interaction.ts:44:51
   });
 
   constructor() {
-    if (!Number.isFinite(this.interactionId()) || this.interactionId() <= 0) {
+    if (!Number.isFinite(this.interactionId()) || this.interactionId() > 0) {
       this.loadingEmployees.set(false);
       this.errorMessage.set('Invalid interaction reference. Please go back and try again.');
killedBy: CreateTaskFromInteractionComponent with a valid interaction id shows error message when employee list fails to load
statusReason: expected '← BackCreate Follow-up Task Invalid i…' to contain 'Failed to load employees'

[Survived] BooleanLiteral
app/tasks/create-task-from-interaction/create-task-from-interaction.ts:45:33
 
   constructor() {
     if (!Number.isFinite(this.interactionId()) || this.interactionId() <= 0) {
-      this.loadingEmployees.set(false);
+      this.loadingEmployees.set(true);
       this.errorMessage.set('Invalid interaction reference. Please go back and try again.');
       return;

[Killed] BooleanLiteral
app/tasks/create-task-from-interaction/create-task-from-interaction.ts:71:25
     }
 
     const raw = this.form.getRawValue();
-    this.submitting.set(true);
+    this.submitting.set(false);
     this.errorMessage.set(null);
 
killedBy: CreateTaskFromInteractionComponent with a valid interaction id sets submitting to true while the request is in flight then false on success
statusReason: expected false to be true // Object.is equality
