[Killed] EqualityOperator
app/employees/employee-form/employee-form.ts:25:38
       ? Number(this.route.snapshot.paramMap.get('id'))
       : undefined
   );
-  protected readonly isEdit = signal(this.employeeId() !== undefined);
+  protected readonly isEdit = signal(this.employeeId() === undefined);
   protected readonly submitting = signal(false);
   protected readonly errorMessage = signal<string | null>(null);
killedBy: EmployeeFormComponent — create mode isEdit() returns false in create mode
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
app/employees/employee-form/employee-form.ts:25:38
       ? Number(this.route.snapshot.paramMap.get('id'))
       : undefined
   );
-  protected readonly isEdit = signal(this.employeeId() !== undefined);
+  protected readonly isEdit = signal(true);
   protected readonly submitting = signal(false);
   protected readonly errorMessage = signal<string | null>(null);
killedBy: EmployeeFormComponent — create mode isEdit() returns false in create mode
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
app/employees/employee-form/employee-form.ts:26:42
       : undefined
   );
   protected readonly isEdit = signal(this.employeeId() !== undefined);
-  protected readonly submitting = signal(false);
+  protected readonly submitting = signal(true);
   protected readonly errorMessage = signal<string | null>(null);
 
killedBy: EmployeeFormComponent — create mode submitting starts as false
statusReason: expected true to be false // Object.is equality

[Survived] BooleanLiteral
app/employees/employee-form/employee-form.ts:33:50
     firstName: new FormControl('', { nonNullable: true, validators: [Validators.required] }),
     lastName: new FormControl('', { nonNullable: true, validators: [Validators.required] }),
     email: new FormControl('', { nonNullable: true, validators: [Validators.required, Validators.email] }),
-    jobTitle: new FormControl('', { nonNullable: true }),
+    jobTitle: new FormControl('', { nonNullable: false }),
     department: new FormControl('', { nonNullable: true }),
     phone: new FormControl('', { nonNullable: true })

[Survived] BooleanLiteral
app/employees/employee-form/employee-form.ts:34:52
     lastName: new FormControl('', { nonNullable: true, validators: [Validators.required] }),
     email: new FormControl('', { nonNullable: true, validators: [Validators.required, Validators.email] }),
     jobTitle: new FormControl('', { nonNullable: true }),
-    department: new FormControl('', { nonNullable: true }),
+    department: new FormControl('', { nonNullable: false }),
     phone: new FormControl('', { nonNullable: true })
   });

[Survived] ObjectLiteral
app/employees/employee-form/employee-form.ts:34:37
     lastName: new FormControl('', { nonNullable: true, validators: [Validators.required] }),
     email: new FormControl('', { nonNullable: true, validators: [Validators.required, Validators.email] }),
     jobTitle: new FormControl('', { nonNullable: true }),
-    department: new FormControl('', { nonNullable: true }),
+    department: new FormControl('', {}),
     phone: new FormControl('', { nonNullable: true })
   });

[Survived] BooleanLiteral
app/employees/employee-form/employee-form.ts:35:47
     email: new FormControl('', { nonNullable: true, validators: [Validators.required, Validators.email] }),
     jobTitle: new FormControl('', { nonNullable: true }),
     department: new FormControl('', { nonNullable: true }),
-    phone: new FormControl('', { nonNullable: true })
+    phone: new FormControl('', { nonNullable: false })
   });
 

[Survived] StringLiteral
app/employees/employee-form/employee-form.ts:35:28
     email: new FormControl('', { nonNullable: true, validators: [Validators.required, Validators.email] }),
     jobTitle: new FormControl('', { nonNullable: true }),
     department: new FormControl('', { nonNullable: true }),
-    phone: new FormControl('', { nonNullable: true })
+    phone: new FormControl("Stryker was here!", { nonNullable: true })
   });
 

[Killed] BlockStatement
app/employees/employee-form/employee-form.ts:38:17
     phone: new FormControl('', { nonNullable: true })
   });
 
-  constructor() {
-    const id = this.employeeId();
-    if (id !== undefined) {
-      this.employeeService.getProfile(id)
-        .pipe(takeUntilDestroyed(this.destroyRef))
-        .subscribe({
-          next: emp => {
-            this.form.patchValue({
-              firstName: emp.firstName,
-              lastName: emp.lastName,
-              email: emp.email,
-              jobTitle: emp.jobTitle ?? '',
-              department: emp.department ?? '',
-              phone: emp.phone ?? ''
-            });
-          },
-          error: () => this.errorMessage.set('Failed to load employee data.')
-        });
-    }
-  }
+  constructor() {}
 
   protected onSubmit(): void {
killedBy: EmployeeFormComponent — edit mode pre-fills the form with the existing employee data
statusReason: expected '' to be 'Alice' // Object.is equality

[Killed] BlockStatement
app/employees/employee-form/employee-form.ts:40:27
 
   constructor() {
     const id = this.employeeId();
-    if (id !== undefined) {
-      this.employeeService.getProfile(id)
-        .pipe(takeUntilDestroyed(this.destroyRef))
-        .subscribe({
-          next: emp => {
-            this.form.patchValue({
-              firstName: emp.firstName,
-              lastName: emp.lastName,
-              email: emp.email,
-              jobTitle: emp.jobTitle ?? '',
-              department: emp.department ?? '',
-              phone: emp.phone ?? ''
-            });
-          },
-          error: () => this.errorMessage.set('Failed to load employee data.')
-        });
-    }
+    if (id !== undefined) {}
   }
 
killedBy: EmployeeFormComponent — edit mode pre-fills the form with the existing employee data
statusReason: expected '' to be 'Alice' // Object.is equality

[Killed] BlockStatement
app/employees/employee-form/employee-form.ts:44:24
       this.employeeService.getProfile(id)
         .pipe(takeUntilDestroyed(this.destroyRef))
         .subscribe({
-          next: emp => {
-            this.form.patchValue({
-              firstName: emp.firstName,
-              lastName: emp.lastName,
-              email: emp.email,
-              jobTitle: emp.jobTitle ?? '',
-              department: emp.department ?? '',
-              phone: emp.phone ?? ''
-            });
-          },
+          next: emp => {},
           error: () => this.errorMessage.set('Failed to load employee data.')
         });
killedBy: EmployeeFormComponent — edit mode pre-fills the form with the existing employee data
statusReason: expected '' to be 'Alice' // Object.is equality

[Killed] ObjectLiteral
app/employees/employee-form/employee-form.ts:45:34
         .pipe(takeUntilDestroyed(this.destroyRef))
         .subscribe({
           next: emp => {
-            this.form.patchValue({
-              firstName: emp.firstName,
-              lastName: emp.lastName,
-              email: emp.email,
-              jobTitle: emp.jobTitle ?? '',
-              department: emp.department ?? '',
-              phone: emp.phone ?? ''
-            });
+            this.form.patchValue({});
           },
           error: () => this.errorMessage.set('Failed to load employee data.')
killedBy: EmployeeFormComponent — edit mode pre-fills the form with the existing employee data
statusReason: expected '' to be 'Alice' // Object.is equality

[Survived] ArrowFunction
app/employees/employee-form/employee-form.ts:54:18
               phone: emp.phone ?? ''
             });
           },
-          error: () => this.errorMessage.set('Failed to load employee data.')
+          error: () => undefined
         });
     }

[NoCoverage] StringLiteral
app/employees/employee-form/employee-form.ts:54:46
               phone: emp.phone ?? ''
             });
           },
-          error: () => this.errorMessage.set('Failed to load employee data.')
+          error: () => this.errorMessage.set("")
         });
     }

[Killed] ConditionalExpression
app/employees/employee-form/employee-form.ts:60:9
   }
 
   protected onSubmit(): void {
-    if (this.form.invalid) return;
+    if (false) return;
     this.submitting.set(true);
     this.errorMessage.set(null);
killedBy: EmployeeFormComponent — create mode does not call create() when the form is invalid
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      Object {

[Killed] BooleanLiteral
app/employees/employee-form/employee-form.ts:61:25
 
   protected onSubmit(): void {
     if (this.form.invalid) return;
-    this.submitting.set(true);
+    this.submitting.set(false);
     this.errorMessage.set(null);
 
killedBy: EmployeeFormComponent — create mode sets submitting to true while the request is in flight and false on success
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
app/employees/employee-form/employee-form.ts:69:17
       firstName,
       lastName,
       email,
-      jobTitle: jobTitle || undefined,
+      jobTitle: jobTitle && undefined,
       department: department || undefined,
       phone: phone || undefined
killedBy: EmployeeFormComponent — create mode passes a non-empty jobTitle through to the service
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] LogicalOperator
app/employees/employee-form/employee-form.ts:70:19
       lastName,
       email,
       jobTitle: jobTitle || undefined,
-      department: department || undefined,
+      department: department && undefined,
       phone: phone || undefined
     };
killedBy: EmployeeFormComponent — create mode maps an empty department to undefined before calling the service
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] LogicalOperator
app/employees/employee-form/employee-form.ts:71:14
       email,
       jobTitle: jobTitle || undefined,
       department: department || undefined,
-      phone: phone || undefined
+      phone: phone && undefined
     };
 
killedBy: EmployeeFormComponent — create mode passes non-empty phone through to the service
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ObjectLiteral
app/employees/employee-form/employee-form.ts:79:67
       ? this.employeeService.update(id, request)
       : this.employeeService.create(request);
 
-    operation.pipe(takeUntilDestroyed(this.destroyRef)).subscribe({
-      next: employee => {
-        this.submitting.set(false);
-        void this.router.navigate(['/employees', employee.id]);
-      },
-      error: () => {
-        this.submitting.set(false);
-        this.errorMessage.set('Failed to save employee. Please try again.');
-      }
-    });
+    operation.pipe(takeUntilDestroyed(this.destroyRef)).subscribe({});
   }
 
killedBy: EmployeeFormComponent — create mode navigates to the employee profile after a successful create
statusReason: expected "navigate" to be called with arguments: [ [ '/employees', 1 ] ]

Number of calls: 0

[Killed] BlockStatement
app/employees/employee-form/employee-form.ts:80:25
       : this.employeeService.create(request);
 
     operation.pipe(takeUntilDestroyed(this.destroyRef)).subscribe({
-      next: employee => {
-        this.submitting.set(false);
-        void this.router.navigate(['/employees', employee.id]);
-      },
+      next: employee => {},
       error: () => {
         this.submitting.set(false);
killedBy: EmployeeFormComponent — create mode navigates to the employee profile after a successful create
statusReason: expected "navigate" to be called with arguments: [ [ '/employees', 1 ] ]

Number of calls: 0

[Killed] BooleanLiteral
app/employees/employee-form/employee-form.ts:81:29
 
     operation.pipe(takeUntilDestroyed(this.destroyRef)).subscribe({
       next: employee => {
-        this.submitting.set(false);
+        this.submitting.set(true);
         void this.router.navigate(['/employees', employee.id]);
       },
killedBy: EmployeeFormComponent — create mode sets submitting to true while the request is in flight and false on success
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
app/employees/employee-form/employee-form.ts:82:36
     operation.pipe(takeUntilDestroyed(this.destroyRef)).subscribe({
       next: employee => {
         this.submitting.set(false);
-        void this.router.navigate(['/employees', employee.id]);
+        void this.router.navigate(["", employee.id]);
       },
       error: () => {
killedBy: EmployeeFormComponent — create mode navigates to the employee profile after a successful create
statusReason: expected "navigate" to be called with arguments: [ [ '/employees', 1 ] ]

Received:

  1st navigate call:

  [
    [

[NoCoverage] BlockStatement
app/employees/employee-form/employee-form.ts:84:20
         this.submitting.set(false);
         void this.router.navigate(['/employees', employee.id]);
       },
-      error: () => {
-        this.submitting.set(false);
-        this.errorMessage.set('Failed to save employee. Please try again.');
-      }
+      error: () => {}
     });
   }

[NoCoverage] StringLiteral
app/employees/employee-form/employee-form.ts:86:31
       },
       error: () => {
         this.submitting.set(false);
-        this.errorMessage.set('Failed to save employee. Please try again.');
+        this.errorMessage.set("");
       }
     });

[NoCoverage] BlockStatement
app/employees/employee-form/employee-form.ts:91:28
     });
   }
 
-  protected cancel(): void {
-    const id = this.employeeId();
-    void this.router.navigate(id !== undefined ? ['/employees', id] : ['/employees']);
-  }
+  protected cancel(): void {}
 }
 

[NoCoverage] EqualityOperator
app/employees/employee-form/employee-form.ts:93:31
 
   protected cancel(): void {
     const id = this.employeeId();
-    void this.router.navigate(id !== undefined ? ['/employees', id] : ['/employees']);
+    void this.router.navigate(id === undefined ? ['/employees', id] : ['/employees']);
   }
 }

[NoCoverage] ConditionalExpression
app/employees/employee-form/employee-form.ts:93:31
 
   protected cancel(): void {
     const id = this.employeeId();
-    void this.router.navigate(id !== undefined ? ['/employees', id] : ['/employees']);
+    void this.router.navigate(false ? ['/employees', id] : ['/employees']);
   }
 }
