[Survived] BooleanLiteral
app/employees/employee-profile/employee-profile.ts:21:39
   private readonly destroyRef = inject(DestroyRef);
 
   protected readonly employee = signal<EmployeeProfileResponse | null>(null);
-  protected readonly loading = signal(true);
+  protected readonly loading = signal(false);
   protected readonly archiving = signal(false);
 

[Killed] BooleanLiteral
app/employees/employee-profile/employee-profile.ts:22:41
 
   protected readonly employee = signal<EmployeeProfileResponse | null>(null);
   protected readonly loading = signal(true);
-  protected readonly archiving = signal(false);
+  protected readonly archiving = signal(true);
 
   constructor() {
killedBy: EmployeeProfileComponent calls archive() on the service and reflects archived state
statusReason: expected "vi.fn()" to be called with arguments: [ 1 ]

Number of calls: 0

[Killed] BlockStatement
app/employees/employee-profile/employee-profile.ts:24:17
   protected readonly loading = signal(true);
   protected readonly archiving = signal(false);
 
-  constructor() {
-    const id = Number(this.route.snapshot.paramMap.get('id'));
-    this.employeeService.getProfile(id)
-      .pipe(takeUntilDestroyed(this.destroyRef))
-      .subscribe({
-        next: emp => {
-          this.employee.set(emp);
-          this.loading.set(false);
-        },
-        error: () => this.loading.set(false)
-      });
-  }
+  constructor() {}
 
   protected archive(): void {
killedBy: EmployeeProfileComponent displays the employee name and email
statusReason: expected 'Loading…' to contain 'Alice'

[Survived] StringLiteral
app/employees/employee-profile/employee-profile.ts:25:56
   protected readonly archiving = signal(false);
 
   constructor() {
-    const id = Number(this.route.snapshot.paramMap.get('id'));
+    const id = Number(this.route.snapshot.paramMap.get(""));
     this.employeeService.getProfile(id)
       .pipe(takeUntilDestroyed(this.destroyRef))

[Killed] ObjectLiteral
app/employees/employee-profile/employee-profile.ts:28:18
     const id = Number(this.route.snapshot.paramMap.get('id'));
     this.employeeService.getProfile(id)
       .pipe(takeUntilDestroyed(this.destroyRef))
-      .subscribe({
-        next: emp => {
-          this.employee.set(emp);
-          this.loading.set(false);
-        },
-        error: () => this.loading.set(false)
-      });
+      .subscribe({});
   }
 
killedBy: EmployeeProfileComponent displays the employee name and email
statusReason: expected 'Loading…' to contain 'Alice'

[Killed] BlockStatement
app/employees/employee-profile/employee-profile.ts:29:22
     this.employeeService.getProfile(id)
       .pipe(takeUntilDestroyed(this.destroyRef))
       .subscribe({
-        next: emp => {
-          this.employee.set(emp);
-          this.loading.set(false);
-        },
+        next: emp => {},
         error: () => this.loading.set(false)
       });
killedBy: EmployeeProfileComponent displays the employee name and email
statusReason: expected 'Loading…' to contain 'Alice'

[Killed] BooleanLiteral
app/employees/employee-profile/employee-profile.ts:31:28
       .subscribe({
         next: emp => {
           this.employee.set(emp);
-          this.loading.set(false);
+          this.loading.set(true);
         },
         error: () => this.loading.set(false)
killedBy: EmployeeProfileComponent displays the employee name and email
statusReason: expected 'Loading…' to contain 'Alice'

[Survived] ArrowFunction
app/employees/employee-profile/employee-profile.ts:33:16
           this.employee.set(emp);
           this.loading.set(false);
         },
-        error: () => this.loading.set(false)
+        error: () => undefined
       });
   }

[NoCoverage] BooleanLiteral
app/employees/employee-profile/employee-profile.ts:33:39
           this.employee.set(emp);
           this.loading.set(false);
         },
-        error: () => this.loading.set(false)
+        error: () => this.loading.set(true)
       });
   }

[Killed] BlockStatement
app/employees/employee-profile/employee-profile.ts:37:29
       });
   }
 
-  protected archive(): void {
-    const emp = this.employee();
-    if (!emp || this.archiving()) return;
-    this.archiving.set(true);
-    this.employeeService.archive(emp.id)
-      .pipe(takeUntilDestroyed(this.destroyRef))
-      .subscribe({
-        next: () => {
-          this.employee.set({ ...emp, archived: true });
-          this.archiving.set(false);
-        },
-        error: () => this.archiving.set(false)
-      });
-  }
+  protected archive(): void {}
 }
 
killedBy: EmployeeProfileComponent calls archive() on the service and reflects archived state
statusReason: expected "vi.fn()" to be called with arguments: [ 1 ]

Number of calls: 0

[Survived] BooleanLiteral
app/employees/employee-profile/employee-profile.ts:40:24
   protected archive(): void {
     const emp = this.employee();
     if (!emp || this.archiving()) return;
-    this.archiving.set(true);
+    this.archiving.set(false);
     this.employeeService.archive(emp.id)
       .pipe(takeUntilDestroyed(this.destroyRef))

[Killed] BlockStatement
app/employees/employee-profile/employee-profile.ts:44:21
     this.employeeService.archive(emp.id)
       .pipe(takeUntilDestroyed(this.destroyRef))
       .subscribe({
-        next: () => {
-          this.employee.set({ ...emp, archived: true });
-          this.archiving.set(false);
-        },
+        next: () => {},
         error: () => this.archiving.set(false)
       });
killedBy: EmployeeProfileComponent calls archive() on the service and reflects archived state
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
app/employees/employee-profile/employee-profile.ts:45:49
       .pipe(takeUntilDestroyed(this.destroyRef))
       .subscribe({
         next: () => {
-          this.employee.set({ ...emp, archived: true });
+          this.employee.set({ ...emp, archived: false });
           this.archiving.set(false);
         },
killedBy: EmployeeProfileComponent calls archive() on the service and reflects archived state
statusReason: expected false to be true // Object.is equality

[Survived] BooleanLiteral
app/employees/employee-profile/employee-profile.ts:46:30
       .subscribe({
         next: () => {
           this.employee.set({ ...emp, archived: true });
-          this.archiving.set(false);
+          this.archiving.set(true);
         },
         error: () => this.archiving.set(false)

[Survived] ArrowFunction
app/employees/employee-profile/employee-profile.ts:48:16
           this.employee.set({ ...emp, archived: true });
           this.archiving.set(false);
         },
-        error: () => this.archiving.set(false)
+        error: () => undefined
       });
   }

[NoCoverage] BooleanLiteral
app/employees/employee-profile/employee-profile.ts:48:41
           this.employee.set({ ...emp, archived: true });
           this.archiving.set(false);
         },
-        error: () => this.archiving.set(false)
+        error: () => this.archiving.set(true)
       });
   }
