[Killed] BlockStatement
src/app/home/home.ts:17:48
   private readonly router = inject(Router);
 
   protected readonly user = this.authService.currentUser;
-  protected readonly greeting = computed(() => {
-    const user = this.user();
-    return user ? `Welcome, ${user.firstName}` : 'Welcome';
-  });
+  protected readonly greeting = computed(() => {});
 
   protected logout(): void {
killedBy: HomeComponent shows personalised greeting when a user is logged in
statusReason: expected 'You are signed in to Staff Engagement…' to contain 'Welcome, Alice'

[Killed] StringLiteral
src/app/home/home.ts:19:19
   protected readonly user = this.authService.currentUser;
   protected readonly greeting = computed(() => {
     const user = this.user();
-    return user ? `Welcome, ${user.firstName}` : 'Welcome';
+    return user ? `` : 'Welcome';
   });
 
killedBy: HomeComponent shows personalised greeting when a user is logged in
statusReason: expected 'You are signed in to Staff Engagement…' to contain 'Welcome, Alice'

[Killed] StringLiteral
src/app/home/home.ts:19:50
   protected readonly user = this.authService.currentUser;
   protected readonly greeting = computed(() => {
     const user = this.user();
-    return user ? `Welcome, ${user.firstName}` : 'Welcome';
+    return user ? `Welcome, ${user.firstName}` : "";
   });
 
killedBy: HomeComponent shows generic greeting when no user is loaded
statusReason: expected 'You are signed in to Staff Engagement…' to contain 'Welcome'

[Killed] BlockStatement
src/app/home/home.ts:22:28
     return user ? `Welcome, ${user.firstName}` : 'Welcome';
   });
 
-  protected logout(): void {
-    this.authService.logout();
-    void this.router.navigate(['/login']);
-  }
+  protected logout(): void {}
 }
killedBy: HomeComponent calls authService.logout() and navigates to /login when logout() is called
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ArrayDeclaration
src/app/home/home.ts:24:31
 
   protected logout(): void {
     this.authService.logout();
-    void this.router.navigate(['/login']);
+    void this.router.navigate([]);
   }
 }
killedBy: HomeComponent calls authService.logout() and navigates to /login when logout() is called
statusReason: expected "navigate" to be called with arguments: [ [ '/login' ] ]

Received:

  1st navigate call:

  [
-   [
