[Killed] StringLiteral
src/app/tasks/task.service.ts:16:30
 @Injectable({ providedIn: 'root' })
 export class TaskService {
   private readonly http = inject(HttpClient);
-  private readonly baseUrl = `${environment.apiUrl}/tasks`;
+  private readonly baseUrl = ``;
 
   createFromInteraction(request: CreateTaskFromInteractionRequest): Observable<Task> {
killedBy: TaskService createFromInteraction() posts to /from-interaction
statusReason: Expected one matching request for criteria "Match URL: http://localhost:8080/api/tasks/from-interaction", found none. Requests received are: POST /from-interaction.

[Killed] StringLiteral
src/app/tasks/task.service.ts:19:33
   private readonly baseUrl = `${environment.apiUrl}/tasks`;
 
   createFromInteraction(request: CreateTaskFromInteractionRequest): Observable<Task> {
-    return this.http.post<Task>(`${this.baseUrl}/from-interaction`, request);
+    return this.http.post<Task>(``, request);
   }
 
killedBy: TaskService createFromInteraction() posts to /from-interaction
statusReason: Expected one matching request for criteria "Match URL: http://localhost:8080/api/tasks/from-interaction", found none. Requests received are: POST .

[Killed] StringLiteral
src/app/tasks/task.service.ts:31:34
   }
 
   updateStatus(id: number, request: UpdateTaskStatusRequest): Observable<Task> {
-    return this.http.patch<Task>(`${this.baseUrl}/${id}/status`, request);
+    return this.http.patch<Task>(``, request);
   }
 }
killedBy: TaskService updateStatus() patches to /:id/status
statusReason: Expected one matching request for criteria "Match URL: http://localhost:8080/api/tasks/1/status", found none. Requests received are: PATCH .
