[Killed] StringLiteral
src/app/employees/employee.service.ts:19:51
   }
 
   getProfile(id: number): Observable<EmployeeProfileResponse> {
-    return this.http.get<EmployeeProfileResponse>(`${this.baseUrl}/${id}`);
+    return this.http.get<EmployeeProfileResponse>(``);
   }
 
killedBy: EmployeeService getProfile() fetches the employee by id
statusReason: Expected one matching request for criteria "Match URL: http://localhost:8080/api/employees/1", found none. Requests received are: GET .
