[Killed] BlockStatement
src/app/interactions/interaction.service.ts:19:23
 
   findBySubject(subjectId: number, filter?: InteractionFilter): Observable<InteractionResponse[]> {
     let params = new HttpParams().set('subjectId', subjectId.toString());
-    if (filter?.type) {
-      params = params.set('type', filter.type);
-    }
+    if (filter?.type) {}
     if (filter?.authorId != null) {
       params = params.set('authorId', filter.authorId.toString());
killedBy: InteractionService findBySubject() appends filter params when provided
statusReason: Expected one matching request for criteria "Match URL: http://localhost:8080/api/interactions?subjectId=2&type=MEETING&authorId=5&date=2026-06-25", found none. Requests received are: GET http://localhost:8080/api/interactions?subjectId=2&authorId=5&date=2026-06-25.

[Killed] StringLiteral
src/app/interactions/interaction.service.ts:20:27
   findBySubject(subjectId: number, filter?: InteractionFilter): Observable<InteractionResponse[]> {
     let params = new HttpParams().set('subjectId', subjectId.toString());
     if (filter?.type) {
-      params = params.set('type', filter.type);
+      params = params.set("", filter.type);
     }
     if (filter?.authorId != null) {
killedBy: InteractionService findBySubject() appends filter params when provided
statusReason: Expected one matching request for criteria "Match URL: http://localhost:8080/api/interactions?subjectId=2&type=MEETING&authorId=5&date=2026-06-25", found none. Requests received are: GET http://localhost:8080/api/interactions?subjectId=2&=MEETING&authorId=5&date=2026-06-25.

[Killed] BlockStatement
src/app/interactions/interaction.service.ts:22:35
     if (filter?.type) {
       params = params.set('type', filter.type);
     }
-    if (filter?.authorId != null) {
-      params = params.set('authorId', filter.authorId.toString());
-    }
+    if (filter?.authorId != null) {}
     if (filter?.date) {
       params = params.set('date', filter.date);
killedBy: InteractionService findBySubject() appends filter params when provided
statusReason: Expected one matching request for criteria "Match URL: http://localhost:8080/api/interactions?subjectId=2&type=MEETING&authorId=5&date=2026-06-25", found none. Requests received are: GET http://localhost:8080/api/interactions?subjectId=2&type=MEETING&date=2026-06-25.

[Killed] StringLiteral
src/app/interactions/interaction.service.ts:23:27
       params = params.set('type', filter.type);
     }
     if (filter?.authorId != null) {
-      params = params.set('authorId', filter.authorId.toString());
+      params = params.set("", filter.authorId.toString());
     }
     if (filter?.date) {
killedBy: InteractionService findBySubject() appends filter params when provided
statusReason: Expected one matching request for criteria "Match URL: http://localhost:8080/api/interactions?subjectId=2&type=MEETING&authorId=5&date=2026-06-25", found none. Requests received are: GET http://localhost:8080/api/interactions?subjectId=2&type=MEETING&=5&date=2026-06-25.

[Killed] BlockStatement
src/app/interactions/interaction.service.ts:25:23
     if (filter?.authorId != null) {
       params = params.set('authorId', filter.authorId.toString());
     }
-    if (filter?.date) {
-      params = params.set('date', filter.date);
-    }
+    if (filter?.date) {}
     return this.http.get<InteractionResponse[]>(this.baseUrl, { params });
   }
killedBy: InteractionService findBySubject() appends filter params when provided
statusReason: Expected one matching request for criteria "Match URL: http://localhost:8080/api/interactions?subjectId=2&type=MEETING&authorId=5&date=2026-06-25", found none. Requests received are: GET http://localhost:8080/api/interactions?subjectId=2&type=MEETING&authorId=5.

[Killed] StringLiteral
src/app/interactions/interaction.service.ts:26:27
       params = params.set('authorId', filter.authorId.toString());
     }
     if (filter?.date) {
-      params = params.set('date', filter.date);
+      params = params.set("", filter.date);
     }
     return this.http.get<InteractionResponse[]>(this.baseUrl, { params });
killedBy: InteractionService findBySubject() appends filter params when provided
statusReason: Expected one matching request for criteria "Match URL: http://localhost:8080/api/interactions?subjectId=2&type=MEETING&authorId=5&date=2026-06-25", found none. Requests received are: GET http://localhost:8080/api/interactions?subjectId=2&type=MEETING&authorId=5&=2026-06-25.

[Killed] StringLiteral
src/app/interactions/interaction.service.ts:32:47
   }
 
   findById(id: number): Observable<InteractionResponse> {
-    return this.http.get<InteractionResponse>(`${this.baseUrl}/${id}`);
+    return this.http.get<InteractionResponse>(``);
   }
 
killedBy: InteractionService findById() fetches interaction by id
statusReason: Expected one matching request for criteria "Match URL: http://localhost:8080/api/interactions/1", found none. Requests received are: GET .

[Killed] StringLiteral
src/app/interactions/interaction.service.ts:36:47
   }
 
   update(id: number, request: UpdateInteractionRequest): Observable<InteractionResponse> {
-    return this.http.put<InteractionResponse>(`${this.baseUrl}/${id}`, request);
+    return this.http.put<InteractionResponse>(``, request);
   }
 
killedBy: InteractionService update() puts to /interactions/:id
statusReason: Expected one matching request for criteria "Match URL: http://localhost:8080/api/interactions/1", found none. Requests received are: PUT .
